{"title":"A GIS study of weapon possession crimes in West Midlands County (2023)","markdown":{"yaml":{"title":"A GIS study of weapon possession crimes in West Midlands County (2023)"},"headingText":"Background Information","containsRefs":false,"markdown":"\n\n\nThis is the first page to be uploaded to this website, and more are to follow shortly on other mapping techniques in RStudio, and other social atlas reports.\n\nThis project was produced for a coursework assessment as part of my Geography degree at University College London. The aim was to produce a variety of maps to create a 'social atlas' of any set of data across an area of the United Kingdom. This particular project studies weapon possession crimes in West Midlands County, and uses a variety of different map types to illustrate this.\n\nFeel free to skip to the maps and analysis of these maps in the report. If you are interested in the coding, design, methodology, and many other choices made, I recommend reading the full report to understand why certain decisions were made in this report.\n\nThe main reason weapon possession crimes were chosen for this project was because these have been brought increasingly to the public eye over recent years, with celebrities, such as Idris Elba calling for an “immediate ban on machetes and ‘zombie’ knives”. West Midlands County has the highest rates of weapon possession incidents in the United Kingdom as of 2024, with Birmingham having the highest rates of knife crime in this region.\n\nI would like to thank Professor Justin van Dijk, Lecturer in Social and Geographic Data Science at UCL, for providing assistance and insights to help me create this report, and teaching me some of the techniques used in this report in RStudio. You can visit his website here: <https://mappingdutchman.com/>.\n\n## Data Sources\n\nAll spatial boundaries have been downloaded from the ONS Open Geography Portal <https://geoportal.statistics.gov.uk/>. Boundaries used include: 2021 Lower Super Output Area (LSOA) Boundaries UK, 2023 Local Authority District Boundaries UK, 2018 Metropolitan County Boundaries UK, 2023 Ward Boundaries UK.\n\nPolice crime data can be downloaded from <https://data.police.uk/data/>, and the West Midlands Police Force was selected, and data was downloaded across all months of 2023.\n\nTo obtain Index of Multiple Deprivation (IMD) data by LSOA, a free account can be made on the Consumer Data Research Centre website <https://data.cdrc.ac.uk/>, allowing 2019 IMD scores by LSOA to be downloaded as a .csv file.\n\nTo obtain 2021 census data variables (population by LSOA, unemployment by ward), the Nomis website can be used <https://www.nomisweb.co.uk/>.\n\nPopulation data from 2020 in raster format, at a 1km resolution for the United Kingdom was downloaded from WorldPop via this link <https://hub.worldpop.org/geodata/summary?id=34480>.\n\nOpenStreetMap data was downloaded through R using the 'osmdata' package.\n\nAll of the files used in this report can be found in the folder titled 'Weapon_Social_Atlas_Files' on my GitHub page here <https://github.com/vmistri91/Portfolio>.\n\n## Loading Packages\n\n```{r, echo=FALSE}\n#Set working directory\nsetwd('C:/Users/vmist/Dropbox/Vishal/Uni Work/Portfolio VM')\n```\n\nThese are all the packages used in this project. The main packages used to create maps using spatial data are 'sf', 'sp', 'tmap'.\n\n```{r, message=FALSE, warning=FALSE, max.print=1}\nlibrary(ggplot2)\nlibrary(dplyr)\nlibrary(sf)\nlibrary(sp)\nlibrary(spData)\nlibrary(spgwr)\nlibrary(tmap)\nlibrary(osmdata)\nlibrary(osmextract)\nlibrary(spdep)\nlibrary(tidyverse)\nlibrary(spatstat)\nlibrary(terra)\nlibrary(dbscan)\nlibrary(dodgr)\nlibrary(geodist)\nlibrary(RColorBrewer)\n```\n\n```{r, echo=FALSE, message=FALSE, warning=FALSE}\nlibrary(knitr)\nlibrary(rmarkdown)\n\n```\n\n## Data Preparation\n\nPreparation steps undertaken in this section are to create large maps showing crime distribution and other variables of interest across West Midlands County.\n\nFirstly, boundary geopackages need to be loaded and prepared in R.\n\n```{r, message=FALSE, warning=FALSE}\n#Load LSOA 2021 geopackage in\nLSOA_eng_2021 <- st_read(\"2021_LSOA.gpkg\")\n\n#Inspect CRS\nst_crs(LSOA_eng_2021) #=27700\n\n#Extract out relevant LSOAs in the West Midlands\nLSOA_WestMidlands <- LSOA_eng_2021[grepl('Birmingham|Coventry|Dudley|Sandwell|Solihull|Walsall|Wolverhampton', LSOA_eng_2021$LSOA21NM), ]\n\n#For maps produced to show the 7 local authorities outlined in West Midlands County, Local Authority gpkg is loaded in\nLA_eng_2023 <- st_read(\"Local_Authorities_2023.gpkg\")\n\n#Inspect CRS\nst_crs(LA_eng_2023) #=27700\n\n#Extract out relevant LAs in the West Midlands\nLA_WestMidlands <- LA_eng_2023[grepl('Birmingham|Coventry|Dudley|Sandwell|Solihull|Walsall|Wolverhampton', LA_eng_2023$LAD23NM), ]\n\n\n```\n\nCrime data is downloaded as 12 .csv files for each month of 2023. Before working in R, these files have been placed into a folder called \"all-crime\" on my PC.\n\n```{r, warning=FALSE, message=FALSE}\n#Load in all 2023 West Midlands Crime Data\nall_crime_wm <- list.files(path = \"all-crime/\", full.names = TRUE, recursive = TRUE) |>\n  lapply(read_csv) |>\n  bind_rows()\n```\n\nSteps to prepare the crime data by LSOA code and to filter by Possession of weapon crimes:\n\n```{r}\n#Using all crime data and merging by lsoa code\n#Aggregation and count\nweapon_possession_2 <- all_crime_wm[grepl('Possession of weapons', all_crime_wm$`Crime type`), ]\nweapons_LSOA<- aggregate(weapon_possession_2$`Crime ID`, by=list(weapon_possession_2$`LSOA code`,weapon_possession_2$`Crime type`), FUN=length)\n\n#Rename columns\nnames(weapons_LSOA)<- c(\"LSOA\",\"Crime\",\"Count\")\nweapons_LSOA<- spread(weapons_LSOA,Crime, Count)\n\n```\n\nThe weapon crime data can be merged to the LSOA spatial file by LSOA code as shown below:\n\n```{r}\n#Merge spatial LSOA file with the aggregated possession of weapons data\nWestMidlands_WeaponPossession<- merge(LSOA_WestMidlands, weapons_LSOA, by.x=\"LSOA21CD\", by.y=\"LSOA\", all.x=T)\n\n#Replace all NAs with 0\nWestMidlands_WeaponPossession[is.na(WestMidlands_WeaponPossession)] = 0\n```\n\nPopulation data can be loaded in and merged to the WestMidlands_WeaponPossession spatial file with the same method as above:\n\n```{r}\n#Load in population data by LSOA\npop21_lsoa <- read.csv('LSOA2021_population_sa.csv')\n\n#Merge this dataset with the larger spatial dataset above\nWestMidlands_WeaponPossession<- merge(WestMidlands_WeaponPossession, pop21_lsoa, by.x=\"LSOA21CD\", by.y=\"lsoa21_code\", all.x=T)\n\n#Replace all NAs with 0\nWestMidlands_WeaponPossession[is.na(WestMidlands_WeaponPossession)] = 0\n```\n\nIMD data can be loaded in and merged to the WestMidlands_WeaponPossession spatial file with the same method as above:\n\n```{r}\n#Load in IMD dataset\nuk_imd_19 <- read.csv('uk_imd2019.csv')\n\n#Merge this dataset with the WestMidlands_WeaponPossession dataset \nWestMidlands_WeaponPossession<- merge(WestMidlands_WeaponPossession, uk_imd_19, by.x=\"LSOA21CD\", by.y=\"LSOA\", all.x=T)\n\n#Replace all NAs with 0\nWestMidlands_WeaponPossession[is.na(WestMidlands_WeaponPossession)] = 0\n```\n\nThe variable name 'Possession of Weapons' can be shorted to an easy to write variable name which has no spaces.\n\n```{r}\n#Rename Possession of weapons variable to shorter name\ncolnames(WestMidlands_WeaponPossession)[colnames(WestMidlands_WeaponPossession) == \"Possession of weapons\"] <- \"weapon_possession\"\n\n```\n\nA new variable should be created to show the rate of weapon crimes by the population of each LSOA. This is because weapon crimes can not be displayed on a map without accounting for the population/size of LSOAs, as this would make a less accurate map, and many crime tends would be masked. For example, Birmingham city centre LSOAs would have the highest weapon crime counts, but accounting for the population in each LSOA would produce different trends and a more accurate map to show weapon possession crime rates in the county.\n\n```{r}\n#Create new variable to show rate of weapons crime using the pop21 variable and crime variable\nWestMidlands_WeaponPossession <- WestMidlands_WeaponPossession |>\n  mutate(weapon_rate = (weapon_possession/as.numeric(WestMidlands_WeaponPossession$pop2021)) * 10000)\n```\n\nIn this case, 'weapon_rate' is the number of weapon possession crimes in each LSOA per 10000 people.\n\n## Creating basic choropleth maps\n\nIt is important in this report to know the names of the locations being discussed across West Midlands County, as shown in this map. (Source: <https://www.pinterest.co.uk/pin/542261611378585403/>).\n\n```{r, echo=FALSE}\nknitr::include_graphics('west midlands boundaries.png')\n```\n\nTo test if all of the above code has worked, this basic choropleth map showing weapon possession crime rates across LSOAs in West Midlands County has been created.\n\n```{r, warning=FALSE, error=FALSE, fig.align='center'}\ntm_shape(WestMidlands_WeaponPossession) + \n  tm_fill(\"weapon_rate\", \n          palette = \"Blues\", \n          style = \"quantile\", \n          n=9, \n          title = \"Rate of possession of weapons crimes\") +\n  tm_borders(alpha=.4) +\n  tm_layout(legend.text.size = 0.6, \n            legend.title.size = 1, \n            frame = FALSE, \n            legend.outside = TRUE)\n```\n\nThis map does effectively show how weapon crime rates are distributed, but this map can be made more presentable. Firstly the colour palette has been changed to \"RdPu\" which is from the RColourBrewer package, which provides a range of different pre-made colour palettes that can be used in maps. Additionally, the style has been changed to \"fixed\" indicating that the class breaks on this map are going to be pre-specified, as shown in the 'breaks =' line of the code chunk. Borders have been added around each local authority for clarity, and the 'tm_layout' chunk allows elements such as the legend, title and font size to be altered in the map. A compass and scale bar should be included in all maps, and credits for each data source are provided in the map using 'tm_credits'.\n\n```{r, warning=FALSE, error=FALSE, fig.align='center'}\n#Create detailed map to show the rates of weapons crimes in the West Midlands\ntm_shape(WestMidlands_WeaponPossession) +\n  tm_fill(col = \"weapon_rate\",\n    style = \"fixed\",\n    palette = \"RdPu\",\n    n = 9,\n    #Breaks are chosen fixed with these intervals after analysis of the data shown on the quick map above and viewing the data distribution\n    breaks = c(0, 0.1, 7.5, 15, 20, 30, 40, 60, 100, 887.0), \n    title = \"Rate of Weapon Crimes\") +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"Rate of Weapon Possession Crimes in West Midlands County - 2023\",\n    main.title.fontface = 2,\n    fontfamily = \"Mukta\",\n    legend.outside = TRUE,\n    frame = FALSE, \n    legend.outside.position = \"right\",\n    legend.title.size = 1,\n    legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n    position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n    position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, Nomis',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nA MAJOR NOTE FOR ALL MAPS PRODUCED: Titles, axes labels, credits and scale bars may not fit on this webpage. When reproducing the code in R, increase the size of the plot window, and the these labels will all fit.\n\nThis map appears to show that areas in Central Birmingham, Central Wolverhampton and Central Coventry see the highest rates of weapon possession crimes, with most of Solihull, except the city centre, having the lowest rates. An issue of this map is that each zone is a different size, due to how census data is measured in the United Kingdom in Output Areas. This LSOA map is prone to the effects of the Multiple Aerial Unit Problem (MAUP), where trends within each LSOA can be masked due to the 'zoning effect'. The crime point data has all been aggregated at the LSOA level, but each LSOA is differently sized, so this can create inconsistencies in the data analysis. To understand fully the issues faced by the MAUP, two useful readings are by Wong (2009), <https://www.sciencedirect.com/science/article/abs/pii/B9780080449104004752> and Lee (2019) <https://www.tandfonline.com/doi/full/10.1080/13658816.2018.1542699>.\n\n## Using a tessalated hexagon map\n\nTo make the issue of the MAUP less severe, West Midlands County can be divided up into equally sized 500 metre hexagons, which crimes and population data can be aggregated into, to mitigate against the effects of the 'zoning effect'.\n\nFirst the outline of West Midlands County needs to be selected.\n\n```{r}\n#Load in Metropolitan County gpkg data\nMC_2018 <- st_read(\"Metropolitan_Counties_2018.gpkg\")\n#Check crs\nst_crs(MC_2018) #27700\n#Extract all West Midlands County outline data from the large main dataframe\nWest_Midlands_County <- MC_2018[grepl('West Midlands', MC_2018$mcty18nm), ]\n\n```\n\nAll weapon possession crimes then need to then be filtered out to those which occur in West Midlands County.\n\n```{r}\n#Filter out weapon crimes for all of West Midlands County\nall_crime_weapon_possession <- all_crime_wm |>\n  filter(`Crime type` == \"Possession of weapons\" & !is.na(Longitude) & !is.na(Latitude)) |>\n  #Keep longitude/latitude columns\n  dplyr::select(Longitude, Latitude) |>\n  #Transform into point spatial dataframe\n  st_as_sf(coords = c(\"Longitude\", \"Latitude\"), crs = 4236) |>\n  #Transform CRS into 27700 for BNG\n  st_transform(27700)\n```\n\nThe hexagonal grid can be created around all of the weapon possession crimes next. 'c(500,500)' specifies the size of each polygon, and by specifying 'square = FALSE', the polygons in the grid will all be hexagon shaped.\n\n```{r}\n#Make hexagonal grid\narea_honeycomb_grid = st_make_grid(all_crime_weapon_possession, \n                                   c(500, 500), \n                                   what = \"polygons\", \n                                   square = FALSE)\n#Sf and add grid ID\nhoneycomb_grid_sf = st_sf(area_honeycomb_grid) %>%\n  mutate(grid_id = 1:length(lengths(area_honeycomb_grid)))\n```\n\nThe number of weapon crimes in each hexagon can be counted, and these hexagons can be clipped to the West Midlands County boundary created 3 chunks above.\n\n```{r}\n#Count number of weapon crimes in each grid\nhoneycomb_grid_sf$weapon_possession = lengths(st_intersects(honeycomb_grid_sf, all_crime_weapon_possession))\n#Clip to West Midlands Boundary\nhoneycomb_grid_wm <- honeycomb_grid_sf |>\n  st_intersection(West_Midlands_County)\n\n```\n\n## Applying raster population data to hexagon grid map\n\nInstead of using NOMIS 2021 population census data to create the weapon possession rate per 1000 people, raster population data needs to be used. This data covers the entire United Kingdom at 1 kilometre resolution, showing population estimates for each kilometre squared grid. This data can be merged to fit into the hexagons, and then the rate can be calculated via the steps below.\n\nFirstly, the raster population data needs to be loaded into R.\n\n```{r, fig.align='center'}\n#Load raster population data for 2020 UK\npop2020 <- rast(\"gbr_ppp_2020_1km_Aggregated.tif\")\n#Transform projection to EPSG:27700\npop2020 <- pop2020 |> project(\"epsg:27700\")\n#Check how this is plotted\nplot(pop2020)\n```\n\nThis is useful, but this data needs to be cropped to fit the specific region in this study.\n\n```{r, fig.align='center'}\n#Crop and mask raster data to fit into the honeycomb area\npop2020_wm <- crop(pop2020, honeycomb_grid_wm)\npop2020_wm <- mask(pop2020_wm, honeycomb_grid_wm)\n#Check how this is plotted\nplot(pop2020_wm)\n```\n\nThis now shows population estimates in 1km grids across West Midlands County, but this still needs to be merged to the hexagon map spatial file.\n\nTo do this, the raster data needs to be aggregated and then added to the hexagon spatial dataframe. The function to aggregate the data 'fun' is set to the mean.\n\n```{r}\n#Aggregate\nwm_hex_pop <- extract(pop2020_wm, honeycomb_grid_wm, fun = mean)\n#Add to spatial dataframe\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  st_as_sf() |>\n  mutate(population2020 = wm_hex_pop$gbr_ppp_2020_1km_Aggregated)\n\n```\n\nThe results of this can be plotted in a map to check if the tasks have been conducted correctly.\n\n```{r, warning=FALSE, fig.align='center'}\n#Plot map of population in each 500m hexagon in West Midlands County\ntm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2,\n             col = 'black',\n             alpha = 1) +\n  tm_shape(honeycomb_grid_wm) +\n  tm_fill(col = \"population2020\",\n          palette = 'YlGnBu',\n          style = \"quantile\",\n          n=5,\n          title = \"Population Count\",\n          id = \"grid_id\",\n          showNA = FALSE,\n          alpha = 0.6,\n          popup.vars = c(\"Population Count: \" = \"population2020\"),\n          popup.format = list(population2020 = list(format = \"f\", digits = 0))) +\n  tm_borders(col = \"grey40\", \n             lwd = 0.7) +\n  tm_layout(main.title = \"Population Count in 500 metre hexagons in West Midlands County - 2020\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0,5,10,15,20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits(\"Data Source: ONS, WorldPop\",\n             position = c('right', 'bottom'),\n             fontface = 'italic', \n             size = 0.5)\n```\n\nThis map provides a view into how the population is distributed in the county. Birmingham and Coventry have the highest number of residents, and Solihull has the lowest, with most residents concentrated in the north. This map will be useful to refer to throughout the study to understand how population density is inherently linked with the occurrence of weapon possession crimes.\n\nNow that each hexagon contains data for the number of weapon crimes and population, these two variable can be manipulated to create a weapon possession rate per 1000 people variable to be used throughout the study.\n\n```{r}\n#Calculate weapon crime rate per 1000 people variable using the newly created population variable\nhoneycomb_grid_wm$weaponcrime_rate <- (honeycomb_grid_wm$weapon_possession/honeycomb_grid_wm$population2020)*1000\n\n```\n\n## Map of Weapon Possession Crime Rates in West Midlands County\n\nUsing the variable created in the previous step, and the presentation standards outlined in the first maps created, a final map of weapon possession crime rates in the study area can be produced and analysed. The palette has now been selected using a colour choice of my design, where areas with a crime rate of 0 are indicted in green, and areas with increasing crime rates transition from yellow to red.\n\n```{r, warning=FALSE, fig.align='center'}\n#Create hex weapon crime rate per 1000 map\ntm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2,\n             col = 'black',\n             alpha = 1) +\n  tm_shape(honeycomb_grid_wm) +\n  tm_fill(col = \"weaponcrime_rate\",\n          palette = c(\"#009900\", \"#ffff00\", \"#ffcc00\", \"#ffa600\", \"#ff7300\", \"#ff4d00\", \"#ff2600\", \"#ff0000\"),\n          style = \"fixed\",\n          n=8,\n          breaks = c(0,0.1,0.5,0.9,1.5,4.0,10,36,631),\n          title = \"Weapon Possession Crime Rate per 1000 people\",\n          id = \"grid_id\",\n          showNA = FALSE,\n          alpha = 0.6,\n          popup.vars = c(\"Weapon Possession Crime Rate per 1000 people: \" = \"weaponcrime_rate\"),\n          popup.format = list(weaponcrime_rate = list(format = \"f\", digits = 0))) +\n  tm_borders(col = \"grey40\", \n             lwd = 0.7) +\n  tm_layout(main.title = \"Weapon Possession Crime Rate in West Midlands County - 2023\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0,5,10,15,20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits(\"Data Source: ONS, West Midlands Police, WorldPop\",\n             position = c('right', 'bottom'),\n             fontface = 'italic', \n             size = 0.5)\n\n```\n\nAll 7 local authorities’ city centres have the highest weapon crime rates, but there are substantial variations in the rates occurring across the county.\n\nThe authority of Solihull has very rates of weapon crimes, except the city centre which has many hexagons coloured in amber, and some other hexagons located just south in the deep red colour. Birmingham has the greatest number hexagons with weapon crimes occurring, with over half of its area having a minimum of 0.1 weapon crimes occurring per 1000 people. These higher crime rates are mostly concentrated around Birmingham city centre. This pattern is similar for the other authorities, most evident in Coventry and Wolverhampton.\n\n## Spatial Autocorrelation\n\nWhile the hexagon map produced above is useful for identifying weapon possession crime trends, further geospatial queries and techniques can be conducted on the dataset. One useful technique is spatial autocorrelation, which measures the degree to which similar values (of crime) occur near eachother in a study region, in a positive or negative manner. This concept links to Tobler's Fist Law of Geography which is \"Everything is related to everything else, but near things are more related than distant things\", a foundational concept in GIS.\n\nIn order to conduct spatial autocorrelation, the neighbour radius of each hexagon needs to be defined, to conduct a spatial weights matrix, which helps to quantify the influence of a particular hexagon on surrounding hexagons. This is used to calculate Global and Local measures of Spatial Autocorrelation.\n\nIn this particular study, a fixed distance neighbour definition is used, which defines a hexagon's neighbours as spatial units which lie within a fixed distance (in this case 1500 metre radius) of the particular hexagon.\n\n```{r}\n#Calculate fixed distance neighbours\nhex_neighbours_fd <- dnearneigh(st_geometry(st_centroid(honeycomb_grid_wm)),\n                                 0, 1500)\n\n#Calculate centroids of all hex grids in West Midlands county\nhex_centroid <- honeycomb_grid_wm |>\n  st_centroid()\n\n#Plot fixed distance neighbours\nplot(hex_neighbours_fd, st_geometry(hex_centroid), col = \"blue\", pch = 20, cex = 0.5)\n\n#Create neighbours list\nhex_spatial_weights_fd <- hex_neighbours_fd |>\n  nb2listw(style = \"W\")\n```\n\nCentroids of each hexagon are used in the neighbour determination, as this provides a uniform method of defining where the 1500 metre radius should be drawn from each hexagon.\n\nGlobal spatial autocorrelation measures identify the degree of clustering or dispersion of the data in the entire study area. The most commonly used global method is Moran's I, which quantifies the degree of autocorrelation, providing correlation coefficients between an area and its neighbours. A score is provided between 1 and -1, with 1 indicating perfect clustering, and -1 indicating perfect dispersion across the region.\n\n```{r}\n#Create a Moran's plot\nmoran.plot(honeycomb_grid_wm$weaponcrime_rate, listw = hex_spatial_weights_fd)\n\n#Conduct Moran's I\nmoran_fd <- honeycomb_grid_wm |>\n  pull(weaponcrime_rate) |>\n  as.vector() |>\n  moran.test(hex_spatial_weights_fd)\n\n#Inspect result\nmoran_fd\n#=3.944465e-02\n```\n\nThe overall value of Moran's I is 3.944465e-02, indicating there is little to no spatial autocorrelation among weapon possession crime rates in the study area. This indicates that areas with neither high crime rates or low crime rates are clustered among similar areas.\n\nLocal spatial autocorrelation measures can also be conducted across the study area, which provide a Moran's I value for each individual hexagon, and can be useful to identify local clusters and outliers.\n\n```{r}\n#Conduct Local Moran's I\nlocal_moran_fd <- honeycomb_grid_wm |>\n  pull(weaponcrime_rate) |>\n  as.vector() |>\n  localmoran(hex_spatial_weights_fd)\n\n#Inspect result\nhead(local_moran_fd)\n\n```\n\nThe variable names can be renamed for clarity and these values can be binded to the hexagon grid data frame.\n\n```{r}\n#Update heading names\nlocal_moran_fd <- as.data.frame(local_moran_fd)\nnames(local_moran_fd) <- c(\"LMI_Ii\", \"LMI_eIi\", \"LMI_varIi\", \"LMI_zIi\", \"LMI_sigP\")\n\n#Join the data frames together\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(local_moran_fd)\n```\n\nThe local values can now be mapped across the study area as shown below.\n\n```{r, warning=FALSE, fig.align='center'}\n#Map Local Moran's I\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"LMI_Ii\",\n              style = \"pretty\",\n              midpoint = 0,\n              title = \"Local Moran's I statistic\") +\n  tm_layout(main.title = \"Local Moran's I statistic\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"bottom\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\"))\n```\n\nThis is not a very presentable nor easy to interpret map, so it can be refined. Significance breaks can be set to identify which areas have the most significant Moran's I values. Additionally, a colour palette can be set to identify these significant hexagons on the map as shown below.\n\n```{r, warning=FALSE, fig.align='center'}\n#Set significance breaks\nbreaks <- c(0, 0.05, 0.1, 1)\n\n#Set colour palette\ncolours <- c(\"#ffffff\", \"#ff9480\", \"#ff2800\")\n\n#Map Local Moran's I with the significant points coloured\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"LMI_sigP\",\n              style = \"fixed\",\n              breaks = breaks,\n              palette = rev(colours),\n              title = \"p-value of Local Moran's I statistic\") +\n  tm_layout(main.title = \"Local Moran's I Significant clusters\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"bottom\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\"))\n```\n\nThis map confirms the result from the Global test, where there does not appear to be much spatial autocorrelation in the data, but this map identifies that Central Birmingham and North Solihull have significant clusters of crime data. This map can be further refined as outlined below.\n\nUsing both Moran's I values and statistical significance for each hexagon, a Local Indicators of Spatial Autocorrelation (LISA) map can be created, as outlined by Anselin (1995) here <https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1538-4632.1995.tb00338.x>. The map creates 4 quadrants, which identify different types of spatial autocorrelation. Low-low identifies areas with low values surrounded by low values of crime and high-high identifies areas with high values surrounded by high values of crime. High-low identifies areas with a high value surrounded by areas with low values, and Low-high identifies areas with a low value surrounded by areas with high values, essentially identifying hexagons which are outliers.\n\nTo create this map, significance breaks and a significance level need to be set. In this study, the significance level is set to 0.1.\n\n```{r}\n#Set Significance breaks\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(obs_diff = (weaponcrime_rate - mean(honeycomb_grid_wm$weaponcrime_rate)))\n\n#Compare local Local Moran's I value with mean value\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(LMI_diff = (honeycomb_grid_wm$LMI_Ii - mean(honeycomb_grid_wm$LMI_Ii)))\n\n#Set significance threshold\nsignif <- 0.1\n```\n\nThe four different types of clusters can then be identified, and colour palette can be selected for the map which will be produced.\n\n```{r}\n#Set the four types of clusters that can be present\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(cluster_type = case_when(\n    obs_diff > 0 & LMI_diff > 0 & LMI_sigP < signif ~ \"High-High\",\n    obs_diff < 0 & LMI_diff < 0 & LMI_sigP < signif ~ \"Low-Low\",\n    obs_diff < 0 & LMI_diff > 0 & LMI_sigP < signif ~ \"Low-High\",\n    obs_diff > 0 & LMI_diff < 0 & LMI_sigP < signif ~ \"High-Low\",\n    LMI_sigP > signif ~ \"No Significance\"))\n\n#Count cluster types\ncount(honeycomb_grid_wm, cluster_type)\n\n#Create colour palette\npal <- c(\"#ff2800\", \"#ff9480\", \"#133a7c\", \"#ffffff\")\n```\n\nThe LISA map can now be produced, as shown in this code chunk.\n\n```{r, warning=FALSE, fig.align='center'}\n#Plot the different clusters as a LISA map\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"cluster_type\",\n              palette = pal,\n              title = \"Cluster Type\") +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"LISA map of weapon crime rate in West Midlands County\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, WorldPop',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThis map shows that there is a high-high cluster of weapon crime rates in Central Birmingham, with some high-low clusters towards the edge of the centre. Additionally, North Solihull is mostly a low-low cluster of weapon crime rates, but there are particular hexagons in the area which identify high weapon crime rates.\n\nA different measure of spatial autocorrelation can also be conducted. The Getis Ord Gi\\* statistic can be calculated for each hexagon and a hot/cold spot map can be produced across the study area. This method was proposed by Getis and Ord (1992) here <https://onlinelibrary.wiley.com/doi/10.1111/j.1538-4632.1992.tb00261.x>. The method compares local values to the global sum, considering spatial relationships between neighbours; and the method incorporates the spatial weights matrix and computes z-scores to determine significance. Using z-scores, adjusting for significance, hotspots and cold spots can be determined where higher z-scores indicate hotspots and lower z-scores indicate cold spots.\n\nUsing the defined fixed distance neighbours, the Gi\\* test can be conducted, and this data can be joined to the hexagon data frame.\n\n```{r}\n#Gi* test\ngi_fd <- honeycomb_grid_wm |>\n  pull(weaponcrime_rate) |>\n  as.vector() |>\n  localG(hex_spatial_weights_fd)\n\n#Join data together\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(weaponcrime_gi = as.numeric(gi_fd))\n\n#Inspect dataset\nhoneycomb_grid_wm\n```\n\nUsing the data above, and selecting an appropriate colour palette, the hot/cold spot map can be created as shown below.\n\n```{r, warning=FALSE, fig.align='center'}\n#Set colour palette\npal2 <- c(\"#81c4ff\", \"#ff9480\", \"#ff3e1a\", \"#ff2800\", \"#b31c00\")\n\n#Plot the different clusters\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"weaponcrime_gi\",\n              style = \"pretty\",\n              midpoint = 0,\n              title = \"Local Gi* statistic\",\n              palette = pal2) +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"Hot/Coldspot map of weapon crime rates in West Midlands County\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, WorldPop',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThis map suggests that the highest weapon crime rates are found in North Solihull, and to a lesser degree in the central areas of all other local authorities. Most areas outside the city centres have dispersed weapon crime rates.\n\n## Geographically Weighted Regression\n\nTo test the relationship between weapon crime rates and another variable of interest, a geographically weighted regression (GWR) can be performed. This is better than a linear regression model, as GWR accounts for spatial weights within each spatial unit. The comparison variable of interest for this study is the Index of Multiple Deprivation (IMD), as this consists of many variables in its creation, including income and health statistics, and there could potentially be a link between high levels of deprivation and high crime rates.\n\n```{r, warning=FALSE, fig.align='center'}\n#Create detailed map to show IMD in the West Midlands\ntm_shape(WestMidlands_WeaponPossession) +\n  tm_fill(col = \"SOA_decile\",\n          style = \"fixed\",\n          palette = \"RdYlBu\",\n          n = 10,\n          #Breaks are chosen fixed with these intervals as IMD goes in this scale\n          breaks = c(0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10), \n          title = \"IMD Decile Scores\",\n          labels = c('Worst Performing', '9th', '8th', '7th', '6th', '5th', '4th', '3rd', '2nd', 'Best Performing')) +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"IMD decile scores for West Midlands County - 2019\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: ONS, CRDC',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThe map shows that the centres of Birmingham, Sandwell and Coventry have high deprivation scores, and most of Solihull and the edges of most authorities have low deprivation scores.\n\nA MAJOR NOTE FOR GWR: Since the IMD is calculated by LSOA, this cannot be aggregated to the hexagons formed in previous maps. Fortunately at the start of this report, weapon crime rates per 1000 people were calculated by LSOA, using 2021 population data from the census, so this will be used for this section.\n\nBefore conducting the GWR, a standard regression model is created to see what the inital correlation between weapon possession crime rates and the IMD.\n\n```{r}\nlinearmodel <- lm(WestMidlands_WeaponPossession$weapon_rate ~ WestMidlands_WeaponPossession$SOA_pct)\nsummary(linearmodel)\n#Multiple R-squared = 0.07289\n```\n\nWhile p-values are significant for this model, the relatively low multiple R-squared value of 0.07289 indicates that 7.29% of variance is explained by model. This model can be much improved through GWR.\n\nTo work with the 'spgwr' package, the spatial object needs to be reformatted.\n\n```{r}\n#The WestMidlands_WeaponPossession object reformatted to a different type of spatial object\nWestMidlands_WeaponPossession.SP<- as(WestMidlands_WeaponPossession, \"Spatial\")\n```\n\nThe GWR calculates local coefficients for each LSOA, using adaptive kernel bandwidths to provide stronger results by accounting for the varying data density in each LSOA.\n\n```{r}\n#Calculate kernel bandwidth, adaptive\nGWRbandwidth <- gwr.sel(WestMidlands_WeaponPossession.SP$weapon_rate ~ \n                          WestMidlands_WeaponPossession.SP$SOA_pct, \n                        data=WestMidlands_WeaponPossession.SP,\n                        adapt=T)\n```\n\nAfter performing this, the GWR model can be created and the results can be viewed.\n\n```{r}\n#Run GWR model and view the results after\ngwr.model = gwr(WestMidlands_WeaponPossession.SP$weapon_rate ~ \n                  WestMidlands_WeaponPossession.SP$SOA_pct, \n                data = WestMidlands_WeaponPossession.SP, \n                adapt=GWRbandwidth, \n                hatmatrix=TRUE, \n                se.fit=TRUE) \ngwr.model\n#Quasi-global R-squared = 0.364\n```\n\nWe can see here that the model performs much better than the linear model as the Quasi-global R2 is 0.3642764, much higher than the linear regression model's score of 0.07289. This indicates that 36.43% of variance is explained by model, which is still not high, but still shows that the GWR is an appropriate method.\n\nIn order to map these results, local coefficients and local R2 values need to be linked to the spatial data frame as shown below.\n\n```{r}\n#Use local R2 values from this model now and local coefficients\nresults <-as.data.frame(gwr.model$SDF)\nnames(results)\ngwr.map <- WestMidlands_WeaponPossession\ngwr.map <- cbind(WestMidlands_WeaponPossession, as.matrix(results))\n```\n\nThe local coefficients for the model can be mapped across West Midlands County, with an appropriate colour palette, and map elements as shown below. Initally a quick qtm map was made for this to see how the breaks are distributed. With this in mind I have selected appropriate class breaks as specified in breaksgwr. The variable \"WestMidlands_WeaponPossession.SP.SOA_pct\" represents the local GWR coefficients for each LSOA\n\n```{r, warning=FALSE, message=FALSE, fig.align='center'}\n#Create GWR coefficient map for IMD Rank\n#Set palette first\npal3 <- c('#ff8000', '#ff9d3b', '#ffce9d', '#7cffc1' ,'#31a354', '#006837')\nbreaksgwr <- c(-3.779, -1.000, -0.500, 0, 0.5000, 1.000, 5.311)\n\ntm_shape(gwr.map) + \n  tm_fill(\"WestMidlands_WeaponPossession.SP.SOA_pct\", \n          n = 6, \n          breaks = breaksgwr, \n          title = \"IMD Rank Coefficient\",\n          palette = pal3) + \n  tm_borders(lwd=0.2, \n             col = 'darkgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"GWR Analysis: IMD vs Weapon Crime Rate in West Midlands County\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, Nomis, CRDC',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThe map displays the local coefficients for each LSOA. Orange coloured areas, such as most of Wolverhampton, central Coventry and Walsall have a negative correlation between the IMD and the weapon crime rate. Areas in the green colour, such as central Birmingham and north and south Solihull show a positive correlation between weapon crime rate and IMD scores. This result was expected as other studies have found a link between deprivation and knife crime.\n\n## Focus on Birmingham\n\nDue to the GWR results suggesting that there is a positive correlation between deprivation and the weapon possession rate, and that Birmingham is the largest city/local authority in the county, the area has been selected for further analysis of weapon crimes.\n\nAnother factor as suggested by academics which links to crime is unemployment, so the first part of the Birmingham analysis will may unemployment across each Ward in the authority, and provide locations of where weapon possession crimes took place.\n\nIt is important in this report to know the names of the wards being discussed across Birmingham as shown in this map. (Source: <https://www.birmingham.gov.uk/wards>).\n\n```{r, echo=FALSE}\nknitr::include_graphics('wards in birmingham.jpg')\n```\n\nMore data preparation steps are required to conduct this as the scale of the maps is changing from the entirety of West Midlands County by LSOA to Birmingham by Ward. Additionally, unemployment and other associated variables need to be loaded into R.\n\nFirstly all the crimes in West Midlands County need to be filtered by weapon possession and transformed to the correct CRS, similar to the first set of data preparation in this report.\n\n```{r}\n#Filter all crimes by Possession of Weapons\ncrime_weapon_possession <- all_crime_wm |>\n  filter(`Crime type` == \"Possession of weapons\" & !is.na(Longitude) & !is.na(Latitude)) |>\n  #Keep longitude/latitude columns\n  dplyr::select(Longitude, Latitude) |>\n  #Transform into point spatial dataframe, set CRS to 4236\n  st_as_sf(coords = c(\"Longitude\", \"Latitude\"), crs = 4236) |>\n  #Transform CRS into 27700 for BNG\n  st_transform(27700)\n```\n\nThis set of spatial data points needs to be saved as a geopackage and loaded back into R.\n\n```{r}\n#Save the crime_weapon_possession spatial frame from the chunk above using st_write as \"WestMidlands_Weapons_2023.gpkg\"\n\n#Load weapon data geopackage in\nweapons_wm_2023 <- st_read(\"WestMidlands_Weapons_2023.gpkg\")\n\n```\n\nThis map is just a test to see whether all the crime points have been created correctly. It should look like this.\n\n```{r, fig.align='center'}\n#Test to see if all data has loaded correctly\n#Plot West Midlands LSOAs and Possession of Weapons points\ntm_shape(LSOA_WestMidlands) +\n  tm_fill() +\n  tm_shape(weapons_wm_2023) +\n  tm_dots(col = \"blue\")\n\n```\n\nSince this section of the report only focuses on Birmingham, the spatial data frames need to be filtered to just include information on Birmingham as shown below.\n\n```{r}\n#Extract out the Birmingham Local Authority\nLA_Birmingham <- LA_eng_2023[grepl('Birmingham', LA_eng_2023$LAD23NM), ]\n\n#Extract out the Birmingham LSOAs\nLSOA_Birmingham <- LSOA_eng_2021[grepl('Birmingham', LSOA_eng_2021$LSOA21NM), ]\n\n#Extract all Birmingham data from the large main dataframe\nBirmingham_WeaponPossession <- WestMidlands_WeaponPossession[grepl('Birmingham', WestMidlands_WeaponPossession$LSOA21NM), ]\n\n```\n\nNext the ward spatial data for Birmingham needs to be loaded into R. After inspecting the dataset, it appears that rows 2752 to 2820 contain all the wards in Birmingham, so these are extracted and the shape is checked to see if there are any errors.\n\n```{r, fig.align='center'}\n#Load in Ward gpkg data\nWards_2023 <- st_read(\"Wards_2023.gpkg\")\n#Check crs\nst_crs(Wards_2023) #27700\n\n#Extract out all wards in Birmingham\nrows_to_extract <- 2752:2820\nWards_Birmingham <- Wards_2023[rows_to_extract, ]\n\n#Check the wards shape is correct\ntm_shape(Wards_Birmingham)+\n  tm_fill() +\n  tm_borders()\n```\n\nIf the map produced looks like the one above, the data preparation steps have been conducted correctly.\n\nAll weapon crimes now need to be filtered to include those which took place in Birmingham. Previous steps which were conducted need to be taken place to sort the newly created all_crime_birmingham into a set of points which only contains data on weapon possession crimes.\n\n```{r}\n#Extract all crimes committed in Birmingham\nall_crime_birmingham <- all_crime_wm[grepl('Birmingham', all_crime_wm$`LSOA name`), ]\n\n#Repeat lines to filter out weapon crimes\nbirmingham_crime_weapon_possession <- all_crime_birmingham |>\n  filter(`Crime type` == \"Possession of weapons\" & !is.na(Longitude) & !is.na(Latitude)) |>\n  #Keep longitude/latitude columns\n  dplyr::select(Longitude, Latitude) |>\n  #Transform into point spatial dataframe, set CRS to 4236\n  st_as_sf(coords = c(\"Longitude\", \"Latitude\"), crs = 4236) |>\n  #Transform CRS into 27700 for BNG\n  st_transform(27700)\n\n#Save the birmingham_crime_weapon_possession spatial frame using st_write as \"Birmingham_Weapons_2023.gpkg\"\n\n#Load weapon data geopackage in\nweapons_birmingham_2023 <- st_read(\"Birmingham_Weapons_2023.gpkg\")\n\n```\n\nAgain, it is useful to check if these tasks have been performed correctly by producing a simple map as shown below.\n\n```{r, fig.align='center'}\n#Check the data works in a map\ntm_shape(LSOA_Birmingham) +\n  tm_fill() +\n  tm_shape(weapons_birmingham_2023) +\n  tm_dots(col = \"blue\")\n```\n\nThis is a correct map which shows all the weapon possession crimes across Birmingham.\n\nThe hexagon map that was previously created for the entirety of West Midlands County can be reproduced for Birmingham. The entire spatial query can be re conducted, with a different hexagon size, but as this is just a demonstration of how what the map would look like, it is kept at the same hexagon size of 500 metres. The only adjustment made in the map design is the breaks have been changed to fit the crime rates for Birmingham, where values range from 0 to 28 instead of 0 to 631.\n\n```{r, warning=FALSE, fig.align='center'}\n#Clip data to fit Birmingham\nhoneycomb_grid_birmingham <- honeycomb_grid_wm |>\n  st_intersection(LA_Birmingham)\n#Create detailed map to show the number of weapons crimes in Birmingham\ntm_shape(LA_Birmingham) +\n  tm_borders(lwd=2,\n             col = 'black',\n             alpha = 1) +\n  tm_shape(honeycomb_grid_birmingham) +\n  tm_fill(col = \"weaponcrime_rate\",\n          palette = c(\"#009900\", \"#ffff00\", \"#ffcc00\", \"#ffa600\", \"#ff7300\", \"#ff4d00\", \"#ff2600\", \"#ff0000\"),\n          style = \"fixed\",\n          n=8,\n          breaks = c(0,0.1,0.5,1,1.5,2,5,10,28),\n          title = \"Weapon Possession Crime Rate per 1000 people\",\n          id = \"grid_id\",\n          showNA = FALSE,\n          alpha = 0.6,\n          popup.vars = c(\"Weapon Possession Crime Rate per 1000 people: \" = \"weaponcrime_rate\"),\n          popup.format = list(weaponcrime_rate = list(format = \"f\", digits = 0))) +\n  tm_borders(col = \"grey40\", \n             lwd = 0.7) +\n  tm_layout(main.title = \"Weapon Possession Crime Rate in Birmingham - 2023\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0,2.5,5,7.5,10),\n               position = c(\"left\", \"top\")) +\n  tm_credits(\"Data Source: ONS, West Midlands Police, WorldPop\",\n             position = c('right', 'bottom'),\n             fontface = 'italic', \n             size = 0.5)\n```\n\nThis is effectively a zoomed in version of the original hexagon map, clearly showing that central Birmingham and west Birmingham seem to have the highest crime rates, with north Birmingham seeing a small number of weapon crimes occurring, indicated by the large number of green hexagons.\n\n## Unemployment and Weapon Crime in Birmingham\n\nAs stated at the start of the previous section, unemployment in Birmingham will be studied alongside weapon possession.\n\nIn order to conduct this, the unemployment data by ward from the 2021 census (downloaded from NOMIS) needs to be loaded and configured in R. The dataset needs to be re coded to create a variable showing the percentage of people who have never worked in each ward. This could be combined with those who said they had not worked in the last 12 months, HOWEVER the 2021 census took place just after the 2020 COVID-19 lockdown, where many people were out of work in that period, so just using 'unemployment: never worked' will be the most reliable data. Additionally, these people are most likely to have stayed unemployed instead of starting work like the 12 month category.\n\n```{r}\n#Load dataset which contains unemployment data \nunemployment_input <- read.csv(\"ts065/census2021-ts065-ward.csv\")\n#Recode dataset to create a variable showing % of people who have never worked in each ward\nunemployment <- data.frame(ward_code=unemployment_input$geography.code,\n                           Unemployment_perc=(unemployment_input$Employment.history..Not.in.employment..Never.worked/unemployment_input$Employment.history..Total..All.usual.residents.aged.16.years.and.over.not.in.employment.the.week.before.the.census)*100)\n#Save dataset to workspace\nwrite.csv(unemployment, \"unemployment_data_ward.csv\", row.names=F)\n```\n\nThe .csv file created with unemployment percentage of each ward needs to be merged to the large spatial data frame which contains the shapes of all of the wards in Birmingham.\n\n```{r}\n#Merge unemployment data to the main spatial file\nWard_Birmingham_Census<- merge(Wards_Birmingham, unemployment, by.x=\"WD23CD\", by.y=\"ward_code\", all.x=T)\n#Replace all NAs with 0\nWard_Birmingham_Census[is.na(Ward_Birmingham_Census)] = 0\nView(Ward_Birmingham_Census)\n#All has merged correctly\n```\n\nBy viewing the dataset, it is easy to determine whether the columns have merged correctly. In each dataset there is a column for the ward code identifier, so it is specified in R that these two columns are the merging point of the two datasets.\n\nWith these preparation tasks being completed, a map can be produced to show unemployment percentages across Birmingham, with a layer of dots on the map to indicate where weapon possession crimes took place in 2023, as shown below. Breaks have been appropriately set by viewing the distribution of unemployment data\n\n```{r, warning=FALSE, fig.align='center'}\n#Choropleth map of weapon crime dots and unemployment percentage across wards\ntm_shape(Ward_Birmingham_Census) +\n  tm_fill(col = \"Unemployment_perc\",\n          style = \"fixed\",\n          palette = c(\"#dadaeb\", \"#bcbddc\", \"#9e9ac8\", \"#807dba\", \"#6a51a3\", \"#4a1486\"),\n          n = 6,\n          breaks = c(17, 29, 33, 36, 43, 54, 67),\n          title = \"% of Unemployed residents in Ward\") +\n  tm_borders(lwd=0.4, \n             col = 'black', \n             alpha = 0.8) +\n  tm_shape(LA_Birmingham) +\n  tm_borders(lwd=2, \n             col = 'black', \n             alpha = 1) +\n  tm_shape(weapons_birmingham_2023)+\n  tm_dots(col = 'red',\n          size = 0.05) +\n  tm_layout(main.title = \"% of Unemployed Residents and Weapon Crimes in Birmingham\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE, \n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 2.5, 5, 7.5, 10),\n               position = c(\"left\", \"top\")) +\n  tm_credits('Data source: West Midlands Police, ONS, Nomis',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nRed dots indicate each weapon possession crime which took place in 2023. The map clearly shows that the areas with low unemployment rates have a low number of weapon crimes, including all the wards in Sutton Coldfield, and the ward of Bourneville & Cotteridge. There are many areas with high unemployment and a high number of crimes closer to the city centre, including the wards of Handsworth and Small Heath.\n\n## Point Pattern Analysis\n\nPoint Pattern Analysis techniques, such as Kernel Density Estimation (KDE) can help to view whether weapon crimes are concentrated in certain areas of Birmingham statistically. KDE presents a heat map displaying the distribution between central areas (kernels) and their neighbouring regions. This is a useful technique to understand the clustering and concentration of weapon crimes using point data not aggregated to spatial units.\n\nThe spatial data needs to be converted to a ppp format from a sf (simple features) format, using the 'spatstat' package to conduct the KDE.\n\n```{r}\n#Sf to ppp\nwindow = as.owin(LA_Birmingham)\nbirmingham_weapon_crime_ppp <- ppp(st_coordinates(weapons_birmingham_2023)[, 1], \n                      st_coordinates(weapons_birmingham_2023)[,2], \n                      window = window)\n```\n\nIt is a good idea to inspect this ppp dataset.\n\n```{r}\n#Inspect\nplot(birmingham_weapon_crime_ppp)\n\n```\n\nThe warning suggests that there are duplicated points in the data, where weapon possession crimes have occurred in the same place. To fix this, an offset can be added to the points to remove any duplication issues.\n\n```{r}\n#Check for duplicates\nanyDuplicated(birmingham_weapon_crime_ppp)\n#Count number of duplicated points\nsum(multiplicity(birmingham_weapon_crime_ppp) > 1)\n\n#Add offset to points\nbirmingham_weapon_crime_ppp_jitter <- rjitter(birmingham_weapon_crime_ppp, \n                                 radius = 5, \n                                 retry = TRUE, \n                                 nsim = 1,\n                                 drop = TRUE)\n\n#Check for duplicates\nanyDuplicated(birmingham_weapon_crime_ppp_jitter)\n```\n\nBy doing this all duplication warnings have been resolved.\n\nEach crime point needs to be fitted to a Gaussian kernel bandwidth. The Gaussian method is the most commonly used, but there are other types of bandwidths available. A sigma value needs to be determined for each crime point kernel to determine the radius of the bandwidth, helping to define which points can be placed in the clusters. The value chosen for this study is 800 metres. This value was selected to ensure a sufficiently smooth density distribution was created and that no key features in the data were distorted.\n\n```{r}\n#Clip by Birmingham outline to raster\n#800m sigma value\nkde_800g_raster <- density.ppp(birmingham_weapon_crime_ppp_jitter, sigma = 800) |>\n  rast()\n\n#Add CRS\ncrs(kde_800g_raster) <- \"epsg:27700\"\n\n#Check CRS\nst_crs(kde_800g_raster)\n```\n\nThe KDE raster layer for weapon possession crimes can now be mapped as shown below. The palette is chosen appropriately from the 'RColorBrewer' package, and the style is chosen as 'cont' as this provides the most aesthetically pleasing map where the colour gradient changes smoother than a standard method.\n\n```{r, warning=FALSE, fig.align='center'}\n#Map kde raster\ntm_shape(kde_800g_raster) +\n  tm_raster(col = \"lyr.1\",\n    palette = 'YlOrRd', \n    style = 'cont',\n    title = \"KDE Layer\") +\n  tm_shape(Wards_Birmingham) +\n  tm_borders(lwd=0.5,\n             alpha=0.5,\n             col = 'black') +\n  tm_shape(LA_Birmingham) +\n  tm_borders(lwd=2,\n             alpha=1,\n             col = 'black') +\n  tm_layout(main.title = \"KDE Heatmap of weapon crimes in Birmingham\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE, \n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 2.5, 5, 7.5, 10),\n               position = c(\"left\", \"top\")) +\n  tm_credits('Data source: West Midlands Police, ONS',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThere is a clear high-density area in the city centre, with this area spreading out across most of the wards in Central Birmingham. In contrast Sutton Coldfield and wards in the south have low KDE values, indicating crimes are not clustered in these areas.\n\n## Link to train stations\n\nAs train stations are entry nodes for people unfamiliar to a city to enter, crime can concentrate in these locations, so crimes taking place within a certain proximity of train stations in Central Birmingham can be mapped.\n\nUsing the KDE analysis from the previous section, wards which lie in Central Birmingham have been selected for this map and its analysis, as most crimes tend to concentrate here.\n\nFirstly all wards in the central cluster area need to be extracted from the Ward_Birmingham_Census spatial data frame. By viewing this dataset, the names of the wards in the centre and what rows they are in the dataset can be selected for extraction.\n\n```{r}\n#Extract out wards in the central cluster area\nrows_to_extract_2 <- c(3,4,5,8,9,10,14,20,21,25,26,28,30,34,36,38,39,40,50,51,52,53,54,65,66,68,69)\nWard_Central_Birmingham_Census <- Ward_Birmingham_Census[rows_to_extract_2, ]\n```\n\nAgain, it is a good idea to check if this has been performed correctly.\n\n```{r, fig.align='center'}\n#Quick check of shape\ntm_shape(Ward_Central_Birmingham_Census)+\n  tm_fill() +\n  tm_borders()\n```\n\nIf the shape looks like this, the extraction has been performed correctly.\n\nThe outline of Central Birmingham needs to be specified for the Overpass API to extract train stations in the area from OpenStreetMap.\n\n```{r, fig.align='center'}\n#Union of data\ncentral_birmingham_outline <- Ward_Central_Birmingham_Census |>\n  st_union()\nplot(central_birmingham_outline)\n```\n\nIn order to extract the railway station points in this area, the latitude, longitude and bounding box of the outline need to be extracted for the Overpass API to extract the station data from OpenStreetMap.\n\n```{r}\n#Extract latitude, longitude bounding box from central Birmingham outline\np_bbox <- st_bbox(st_transform(central_birmingham_outline, 4326))\n```\n\nNext, a function in the Overpass API needs to be created which is able to extract stations from Open StreetMap in the defined area.\n\n```{r}\n#Call OverPassQuery function\nstations_central_birmingham_osm <- opq(bbox = p_bbox) |>\n  #Add key and values to sf\n  add_osm_feature(key = \"public_transport\", value = \"station\") |>\n  osmdata_sf()\n```\n\nNow the railway station points can be extracted. Steps such as clipping the data to the outline of central Birmingham, and selecting relevant attributes of each station, such as the name, needs to be conducted here aswell.\n\n```{r}\n#Extract only points\nstations_central_birmingham_osm <- stations_central_birmingham_osm$osm_points |>\n  #Add projection information\n  st_set_crs(4326) |>\n  #Reproject to BNG\n  st_transform(27700) |>\n  #Clip to central Birmingham outline\n  st_intersection(central_birmingham_outline) |>\n  #Select relevant attributes\n  dplyr::select(c(\"osm_id\", \"name\", \"network\", \"operator\", \"public_transport\", \"railway\"))\n```\n\nThese points can now be inspected to see which stations from OSM have been extracted, and if any modifications need to be made.\n\n```{r, fig.align='center'}\n#Inspect these points\nplot(stations_central_birmingham_osm)\n\n```\n\nThis study is only concerned with railways stations not all public transport nodes, so these are extracted from this data frame.\n\n```{r}\n#Extract train stations\nstations_central_birmingham_osm <- stations_central_birmingham_osm |>\n  filter(railway == \"station\")\n\n```\n\nNow these stations can be mapped across Central Birmingham to see if all steps have been conducted correctly, and to visualise the distribution of stations.\n\n```{r, fig.align='center'}\n#Add Central Birmingham outline\ntm_shape(Ward_Central_Birmingham_Census) +\n  tm_fill() +\n  tm_borders() +\n  #Add station data\n  tm_shape(stations_central_birmingham_osm) +\n  tm_dots(col = \"black\",\n          size = 0.1) +\n  #Add other map info\n  tm_compass(type = \"arrow\",\n    position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 1, 2, 3, 4, 5),\n    position = c(\"left\", \"bottom\")) +\n  tm_credits(\"© OpenStreetMap contributors, ONS\")\n```\n\nNow the proximity calculation of the number of weapon crimes occurring within a fixed distance of each station can be conducted. Firstly a single geometry needs to be created for the data.\n\n```{r}\n#Create a single geometry\nstations_central_birmingham_osm_compare <- stations_central_birmingham_osm |>\n  st_union()\n```\n\nFor this study, a 500 metre buffer will be created around each station to count the number of crimes occurring in this radius. 500 metres is chosen as this is a small enough zone around each station where people may immediately travel around upon entering Birmingham.\n\n```{r}\n#Generate a 500m buffer\nstation_500m_buffer <- stations_central_birmingham_osm |>\n  st_buffer(dist = 500)\n\n```\n\nThis buffer can now be used to count the number of weapon possession crime points which fall within the buffer region.\n\n```{r}\n#Intersect buffers with weapon possession crimes and work out number of crimes in each buffer\nstation_500m_buffer$`Total Count` <- lengths(st_intersects(station_500m_buffer, weapons_birmingham_2023))\n\n```\n\nNow a final map can be produced which shows the number of weapon crimes occurring within 500 metres of each railway station in Central Birmingham. This map uses proportionally sized dots using the 'tm_bubbles' function to indicate how many crimes occur around each station. Additionally, these dots are overlayed on a map of unemployment rates across Central Birmingham.\n\n```{r, warning=FALSE, fig.align='center'}\ntm_shape(Ward_Central_Birmingham_Census)+\n  tm_borders(lwd = 0.5,\n             col = 'black',\n             alpha = 1)+\n  tm_fill(col = \"Unemployment_perc\",\n          style = \"fixed\",\n          palette = c(\"#f4f9fd\", \"#9fccf0\", \"#5ba7e6\", \"#2182d2\", \"#16588e\", \"#0b2e4a\"),\n          n = 6,\n          breaks = c(0, 30, 34, 36, 43, 54, 67),\n          title = \"% of unemployed residents in Ward\") +\ntm_shape(station_500m_buffer) +\n  tm_bubbles(size = \"Total Count\", \n             col = \"red\", \n             n=8, \n             style = \"quantile\", \n             legend.size.show=TRUE, \n             title.col = \"Count\", \n             border.col = \"black\", \n             border.lwd = 0.1, \n             border.alpha = 0.1)+\n  tm_layout(main.title = \"Number of Weapon Crimes within 500 metres of a railway station\",\n            main.title.fontface = 2,\n            fontfamily = \"Helvetica\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"bottom\")) +\n  tm_scale_bar(breaks = c(0,1,2,3,4,5),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits(\"© OpenStreetMap contributors, ONS, West Midlands Police\",\n             position = c('right', 'top'),\n             fontface = 'italic', \n             size = 0.5)\n```\n\nAlthough there is theoretical evidence to suggest crimes cluster around stations, this is not the case for 13/16 of the stations having low weapon crime counts. However, three stations: Birmingham New Street, Birmingham Snow Hill, and Birmingham Moor Street, in the city centre have a cluster of weapon crimes occurring within a 500m radius. This makes sense as these are the three stations which connect Birmingham to other major cities in the UK, such as Manchester and London, being a node for people unfamiliar to Birmingham to enter the city.\n\nA major caveat to this is that weapon possession crimes are statistically more likely to occur in a city centre where large groups of people form, and that the large number of crimes by the central stations is a product of this.\n\n## Conclusions and Final Remarks\n\nIn conclusion, this social atlas shows that weapon possession crimes are unevenly distributed in West Midlands County, with clear clusters being identified. The report showed that in certain areas, (Central Birmingham & Solihull) using GWR, there is a positive correlation between the IMD and weapon crime. Additionally, there appears to be a link between unemployment and weapon crime, but it is less clear whether weapon crimes cluster around railway stations. The findings illustrate that there are many factors that link to weapon possession crimes, and that local councils, especially those in Birmingham need to provide strategies to prevent crimes from rising even further.\n\nIt is very important to note that this is not a conclusive study of every single factor which is linked to weapon possession crimes across the region, as for example, population density and household income, among many other factors, need to be accounted for when producing a wider study of the issue. Some of these variables may help to explain some of the trends found in this report, such as why crimes are concentrated in city centres.\n\nOverall, I hope this report provides an overview of weapon crime issues in West Midlands County, and also an overview of different geospatial techniques that can be conducted in RStudio on geospatial data, and large data sets with geographic elements present.\n\n## References\n\nAllen, G., H. Carthew and Y. Zayed (2023) ‘Knife crime statistics England and Wales’, London: House of Commons, <https://commonslibrary.parliament.uk/research-briefings/sn04304/>.\n\nAnselin, L. (1995) ‘Local Indicators of Spatial Association—LISA’, Geographical Analysis, 27, 2, 93-115, <https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1538-4632.1995.tb00338.x>.\n\nBonnier, A., M. Finné and E. Weiberg (2019) ‘Examining land-use through GIS-Based kernel density estimation: a Re-Evaluation of legacy data from the berbati-limnes survey’, Journal of Field Archaeology, 44, 2, 70-83, <https://www.tandfonline.com/doi/full/10.1080/00934690.2019.1570481>.\n\nBrunsdon, C., A.S. Fotheringham and M.E. Charlton (1996) ‘Geographically Weighted Regression: A Method for Exploring Spatial Nonstationarity’, Geographical Analysis, 28, 4, 281-298, <https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1538-4632.1996.tb00936.x>.\n\nCarter, R.L. and K.Q. Hill (1976) ‘The Criminal’s Image of the City and Urban Crime Patterns’, Social Science Quarterly, 57, 3, 597-607, <https://www.sciencedirect.com/book/9780080246338/the-criminals-image-of-the-city>.\n\nCheshire, J.A. and P.A. Longley (2011) ‘Identifying spatial concentrations of surnames’, International Journal of Geographic Information Science, 26, 2, 309-325, <https://www.tandfonline.com/doi/full/10.1080/13658816.2011.591291>.\n\nChiu, S. (1991) ‘Bandwidth Selection for Kernel Density Estimation’, The Annals of Statistics, 19, 4, 1883-1905, <https://www.jstor.org/stable/2241909>.\n\nClement, M. (2010) ‘Teenagers under the knife: a decivilising process’, Journal of Youth Studies, 13, 4, 439-451, <https://www.tandfonline.com/doi/full/10.1080/13676261003802406>.\n\nGetis, A. and J.K. Ord (1992) ‘The Analysis of Spatial Association by Use of Distance Statistics’, Geographical Analysis, 24, 3, 189-206, <https://onlinelibrary.wiley.com/doi/10.1111/j.1538-4632.1992.tb00261.x>.\n\nGimond, M. (2023) Intro to GIS and spatial analysis, ‘Chapter 13: Spatial autocorrelation’, <https://mgimond.github.io/Spatial/spatial-autocorrelation.html>.\n\nHaylock, S., T. Boshari, E.C. Alexander, A. Kumar, L. Manikam and R. Pinder (2020) ‘Risk factors associated with knife-crime in United Kingdom among young people aged 10–24 years: a systematic review’, BMC Public Health, 20, 1451, 1-19, <https://bmcpublichealth.biomedcentral.com/counter/pdf/10.1186/s12889-020-09498-4.pdf>.\n\nIrvin-Erickson, Y. and N. La Vigne (2015) ‘A Spatio-temporal Analysis of Crime at Washington, DC Metro Rail: Stations’ Crime-generating and Crime-attracting Characteristics as Transportation Nodes and Places’, Crime Science, 4, 14, 1-13, <https://crimesciencejournal.biomedcentral.com/articles/10.1186/s40163-015-0026-5>.\n\nLee, S. (2019) ‘Uncertainty in the effects of the modifiable areal unit problem under different levels of spatial autocorrelation: a simulation study’, International Journal of Geographical Information Science, 33, 1, 1135-1154, <https://www.tandfonline.com/doi/full/10.1080/13658816.2018.1542699>.\n\nLivings, M. and A.M. Wu (2020) ‘Local Measures of Spatial Association’ The Geographic Information Science & Technology Body of Knowledge (3rd Quarter 2020 Edition), John P. Wilson (Ed.), <https://gistbok-topics.ucgis.org/AM-03-023>.\n\nLongley, P. et al. (2015) Geographic Information Science & Systems, ‘Chapter 4: Georeferencing’, pp. 77-98, <https://app.knovel.com/kn/resources/kpGISSE001/toc?kpromoter=marc>.\n\nLongley, P.A., J. van Dijk and T. Lan (2021) ‘The geography of intergenerational social mobility in Britain’, Nature Communications, 12, 6050, 1-8, <https://www.nature.com/articles/s41467-021-26185-z>.\n\nRawlinson (2024) ‘Idris Elba calls for immediate ban on machetes and ‘zombie’ knives’, London: The Guardian, <https://www.theguardian.com/uk-news/2024/jan/08/idris-elba-calls-for-immediate-ban-on-machetes-and-zombie-knives?ref=upstract.com>.\n\nRengert, G.F. and B. Lockwood (2009) ‘Geographical Units of Analysis and the Analysis of Crime’, in D. Weisburd, W. Bernasco, and G.J. Bruinsma (eds) Putting Crime in its Place, New York: Springer, 109-122, <https://link.springer.com/chapter/10.1007/978-0-387-09688-9_5>.\n\nShi, X. (2010) ‘Selection of bandwidth type and adjustment side in kernel density estimation over inhomogeneous backgrounds’, International Journal of Geographic Information Science, 24, 5, 643-660, <https://www.tandfonline.com/doi/full/10.1080/13658810902950625>.\n\nThapa, R.B. and R.C. Estoque (2012) ‘Geographically Weighted Regression in Geospatial Analysis’, in Y. Murayama (ed.) Progress in Geospatial Analysis, Tokyo: Springer, 85-96, <https://link.springer.com/chapter/10.1007/978-4-431-54000-7_6>.\n\nWest Midlands Police (2024) ‘Compare your area’, London: Police.UK, <https://www.police.uk/pu/your-area/west-midlands-police/performance/compare-your-area/?tc=BW001>.\n\nWong, D. (2009) ‘Modifiable Areal Unit Problem’, International Encyclopedia of Human Geography, 169-174, <https://www.sciencedirect.com/science/article/abs/pii/B9780080449104004752>.\n\nWong, K. (2021) ‘Create spatial square/hexagon grids and count points inside in R with sf’, Hong Kong: Urban Data Palette, <https://urbandatapalette.com/post/2021-08-tessellation-sf/>.\n\nZhang, H., R. Zahnow, Y. Liu and J. Corcoran (2022) ‘Crime at train stations: The role of passenger presence’, Applied Geography, 140, <https://www.sciencedirect.com/science/article/abs/pii/S0143622822000376>.\n\nZhao, J., H. Zhang and J.A. Zhang (2020) ‘Gaussian kernel adaptive filters with adaptive kernel bandwidth’, Signal Processing, 166, 107270, <https://www.sciencedirect.com/science/article/abs/pii/S016516841930324X>.\n","srcMarkdownNoYaml":"\n\n## Background Information\n\nThis is the first page to be uploaded to this website, and more are to follow shortly on other mapping techniques in RStudio, and other social atlas reports.\n\nThis project was produced for a coursework assessment as part of my Geography degree at University College London. The aim was to produce a variety of maps to create a 'social atlas' of any set of data across an area of the United Kingdom. This particular project studies weapon possession crimes in West Midlands County, and uses a variety of different map types to illustrate this.\n\nFeel free to skip to the maps and analysis of these maps in the report. If you are interested in the coding, design, methodology, and many other choices made, I recommend reading the full report to understand why certain decisions were made in this report.\n\nThe main reason weapon possession crimes were chosen for this project was because these have been brought increasingly to the public eye over recent years, with celebrities, such as Idris Elba calling for an “immediate ban on machetes and ‘zombie’ knives”. West Midlands County has the highest rates of weapon possession incidents in the United Kingdom as of 2024, with Birmingham having the highest rates of knife crime in this region.\n\nI would like to thank Professor Justin van Dijk, Lecturer in Social and Geographic Data Science at UCL, for providing assistance and insights to help me create this report, and teaching me some of the techniques used in this report in RStudio. You can visit his website here: <https://mappingdutchman.com/>.\n\n## Data Sources\n\nAll spatial boundaries have been downloaded from the ONS Open Geography Portal <https://geoportal.statistics.gov.uk/>. Boundaries used include: 2021 Lower Super Output Area (LSOA) Boundaries UK, 2023 Local Authority District Boundaries UK, 2018 Metropolitan County Boundaries UK, 2023 Ward Boundaries UK.\n\nPolice crime data can be downloaded from <https://data.police.uk/data/>, and the West Midlands Police Force was selected, and data was downloaded across all months of 2023.\n\nTo obtain Index of Multiple Deprivation (IMD) data by LSOA, a free account can be made on the Consumer Data Research Centre website <https://data.cdrc.ac.uk/>, allowing 2019 IMD scores by LSOA to be downloaded as a .csv file.\n\nTo obtain 2021 census data variables (population by LSOA, unemployment by ward), the Nomis website can be used <https://www.nomisweb.co.uk/>.\n\nPopulation data from 2020 in raster format, at a 1km resolution for the United Kingdom was downloaded from WorldPop via this link <https://hub.worldpop.org/geodata/summary?id=34480>.\n\nOpenStreetMap data was downloaded through R using the 'osmdata' package.\n\nAll of the files used in this report can be found in the folder titled 'Weapon_Social_Atlas_Files' on my GitHub page here <https://github.com/vmistri91/Portfolio>.\n\n## Loading Packages\n\n```{r, echo=FALSE}\n#Set working directory\nsetwd('C:/Users/vmist/Dropbox/Vishal/Uni Work/Portfolio VM')\n```\n\nThese are all the packages used in this project. The main packages used to create maps using spatial data are 'sf', 'sp', 'tmap'.\n\n```{r, message=FALSE, warning=FALSE, max.print=1}\nlibrary(ggplot2)\nlibrary(dplyr)\nlibrary(sf)\nlibrary(sp)\nlibrary(spData)\nlibrary(spgwr)\nlibrary(tmap)\nlibrary(osmdata)\nlibrary(osmextract)\nlibrary(spdep)\nlibrary(tidyverse)\nlibrary(spatstat)\nlibrary(terra)\nlibrary(dbscan)\nlibrary(dodgr)\nlibrary(geodist)\nlibrary(RColorBrewer)\n```\n\n```{r, echo=FALSE, message=FALSE, warning=FALSE}\nlibrary(knitr)\nlibrary(rmarkdown)\n\n```\n\n## Data Preparation\n\nPreparation steps undertaken in this section are to create large maps showing crime distribution and other variables of interest across West Midlands County.\n\nFirstly, boundary geopackages need to be loaded and prepared in R.\n\n```{r, message=FALSE, warning=FALSE}\n#Load LSOA 2021 geopackage in\nLSOA_eng_2021 <- st_read(\"2021_LSOA.gpkg\")\n\n#Inspect CRS\nst_crs(LSOA_eng_2021) #=27700\n\n#Extract out relevant LSOAs in the West Midlands\nLSOA_WestMidlands <- LSOA_eng_2021[grepl('Birmingham|Coventry|Dudley|Sandwell|Solihull|Walsall|Wolverhampton', LSOA_eng_2021$LSOA21NM), ]\n\n#For maps produced to show the 7 local authorities outlined in West Midlands County, Local Authority gpkg is loaded in\nLA_eng_2023 <- st_read(\"Local_Authorities_2023.gpkg\")\n\n#Inspect CRS\nst_crs(LA_eng_2023) #=27700\n\n#Extract out relevant LAs in the West Midlands\nLA_WestMidlands <- LA_eng_2023[grepl('Birmingham|Coventry|Dudley|Sandwell|Solihull|Walsall|Wolverhampton', LA_eng_2023$LAD23NM), ]\n\n\n```\n\nCrime data is downloaded as 12 .csv files for each month of 2023. Before working in R, these files have been placed into a folder called \"all-crime\" on my PC.\n\n```{r, warning=FALSE, message=FALSE}\n#Load in all 2023 West Midlands Crime Data\nall_crime_wm <- list.files(path = \"all-crime/\", full.names = TRUE, recursive = TRUE) |>\n  lapply(read_csv) |>\n  bind_rows()\n```\n\nSteps to prepare the crime data by LSOA code and to filter by Possession of weapon crimes:\n\n```{r}\n#Using all crime data and merging by lsoa code\n#Aggregation and count\nweapon_possession_2 <- all_crime_wm[grepl('Possession of weapons', all_crime_wm$`Crime type`), ]\nweapons_LSOA<- aggregate(weapon_possession_2$`Crime ID`, by=list(weapon_possession_2$`LSOA code`,weapon_possession_2$`Crime type`), FUN=length)\n\n#Rename columns\nnames(weapons_LSOA)<- c(\"LSOA\",\"Crime\",\"Count\")\nweapons_LSOA<- spread(weapons_LSOA,Crime, Count)\n\n```\n\nThe weapon crime data can be merged to the LSOA spatial file by LSOA code as shown below:\n\n```{r}\n#Merge spatial LSOA file with the aggregated possession of weapons data\nWestMidlands_WeaponPossession<- merge(LSOA_WestMidlands, weapons_LSOA, by.x=\"LSOA21CD\", by.y=\"LSOA\", all.x=T)\n\n#Replace all NAs with 0\nWestMidlands_WeaponPossession[is.na(WestMidlands_WeaponPossession)] = 0\n```\n\nPopulation data can be loaded in and merged to the WestMidlands_WeaponPossession spatial file with the same method as above:\n\n```{r}\n#Load in population data by LSOA\npop21_lsoa <- read.csv('LSOA2021_population_sa.csv')\n\n#Merge this dataset with the larger spatial dataset above\nWestMidlands_WeaponPossession<- merge(WestMidlands_WeaponPossession, pop21_lsoa, by.x=\"LSOA21CD\", by.y=\"lsoa21_code\", all.x=T)\n\n#Replace all NAs with 0\nWestMidlands_WeaponPossession[is.na(WestMidlands_WeaponPossession)] = 0\n```\n\nIMD data can be loaded in and merged to the WestMidlands_WeaponPossession spatial file with the same method as above:\n\n```{r}\n#Load in IMD dataset\nuk_imd_19 <- read.csv('uk_imd2019.csv')\n\n#Merge this dataset with the WestMidlands_WeaponPossession dataset \nWestMidlands_WeaponPossession<- merge(WestMidlands_WeaponPossession, uk_imd_19, by.x=\"LSOA21CD\", by.y=\"LSOA\", all.x=T)\n\n#Replace all NAs with 0\nWestMidlands_WeaponPossession[is.na(WestMidlands_WeaponPossession)] = 0\n```\n\nThe variable name 'Possession of Weapons' can be shorted to an easy to write variable name which has no spaces.\n\n```{r}\n#Rename Possession of weapons variable to shorter name\ncolnames(WestMidlands_WeaponPossession)[colnames(WestMidlands_WeaponPossession) == \"Possession of weapons\"] <- \"weapon_possession\"\n\n```\n\nA new variable should be created to show the rate of weapon crimes by the population of each LSOA. This is because weapon crimes can not be displayed on a map without accounting for the population/size of LSOAs, as this would make a less accurate map, and many crime tends would be masked. For example, Birmingham city centre LSOAs would have the highest weapon crime counts, but accounting for the population in each LSOA would produce different trends and a more accurate map to show weapon possession crime rates in the county.\n\n```{r}\n#Create new variable to show rate of weapons crime using the pop21 variable and crime variable\nWestMidlands_WeaponPossession <- WestMidlands_WeaponPossession |>\n  mutate(weapon_rate = (weapon_possession/as.numeric(WestMidlands_WeaponPossession$pop2021)) * 10000)\n```\n\nIn this case, 'weapon_rate' is the number of weapon possession crimes in each LSOA per 10000 people.\n\n## Creating basic choropleth maps\n\nIt is important in this report to know the names of the locations being discussed across West Midlands County, as shown in this map. (Source: <https://www.pinterest.co.uk/pin/542261611378585403/>).\n\n```{r, echo=FALSE}\nknitr::include_graphics('west midlands boundaries.png')\n```\n\nTo test if all of the above code has worked, this basic choropleth map showing weapon possession crime rates across LSOAs in West Midlands County has been created.\n\n```{r, warning=FALSE, error=FALSE, fig.align='center'}\ntm_shape(WestMidlands_WeaponPossession) + \n  tm_fill(\"weapon_rate\", \n          palette = \"Blues\", \n          style = \"quantile\", \n          n=9, \n          title = \"Rate of possession of weapons crimes\") +\n  tm_borders(alpha=.4) +\n  tm_layout(legend.text.size = 0.6, \n            legend.title.size = 1, \n            frame = FALSE, \n            legend.outside = TRUE)\n```\n\nThis map does effectively show how weapon crime rates are distributed, but this map can be made more presentable. Firstly the colour palette has been changed to \"RdPu\" which is from the RColourBrewer package, which provides a range of different pre-made colour palettes that can be used in maps. Additionally, the style has been changed to \"fixed\" indicating that the class breaks on this map are going to be pre-specified, as shown in the 'breaks =' line of the code chunk. Borders have been added around each local authority for clarity, and the 'tm_layout' chunk allows elements such as the legend, title and font size to be altered in the map. A compass and scale bar should be included in all maps, and credits for each data source are provided in the map using 'tm_credits'.\n\n```{r, warning=FALSE, error=FALSE, fig.align='center'}\n#Create detailed map to show the rates of weapons crimes in the West Midlands\ntm_shape(WestMidlands_WeaponPossession) +\n  tm_fill(col = \"weapon_rate\",\n    style = \"fixed\",\n    palette = \"RdPu\",\n    n = 9,\n    #Breaks are chosen fixed with these intervals after analysis of the data shown on the quick map above and viewing the data distribution\n    breaks = c(0, 0.1, 7.5, 15, 20, 30, 40, 60, 100, 887.0), \n    title = \"Rate of Weapon Crimes\") +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"Rate of Weapon Possession Crimes in West Midlands County - 2023\",\n    main.title.fontface = 2,\n    fontfamily = \"Mukta\",\n    legend.outside = TRUE,\n    frame = FALSE, \n    legend.outside.position = \"right\",\n    legend.title.size = 1,\n    legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n    position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n    position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, Nomis',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nA MAJOR NOTE FOR ALL MAPS PRODUCED: Titles, axes labels, credits and scale bars may not fit on this webpage. When reproducing the code in R, increase the size of the plot window, and the these labels will all fit.\n\nThis map appears to show that areas in Central Birmingham, Central Wolverhampton and Central Coventry see the highest rates of weapon possession crimes, with most of Solihull, except the city centre, having the lowest rates. An issue of this map is that each zone is a different size, due to how census data is measured in the United Kingdom in Output Areas. This LSOA map is prone to the effects of the Multiple Aerial Unit Problem (MAUP), where trends within each LSOA can be masked due to the 'zoning effect'. The crime point data has all been aggregated at the LSOA level, but each LSOA is differently sized, so this can create inconsistencies in the data analysis. To understand fully the issues faced by the MAUP, two useful readings are by Wong (2009), <https://www.sciencedirect.com/science/article/abs/pii/B9780080449104004752> and Lee (2019) <https://www.tandfonline.com/doi/full/10.1080/13658816.2018.1542699>.\n\n## Using a tessalated hexagon map\n\nTo make the issue of the MAUP less severe, West Midlands County can be divided up into equally sized 500 metre hexagons, which crimes and population data can be aggregated into, to mitigate against the effects of the 'zoning effect'.\n\nFirst the outline of West Midlands County needs to be selected.\n\n```{r}\n#Load in Metropolitan County gpkg data\nMC_2018 <- st_read(\"Metropolitan_Counties_2018.gpkg\")\n#Check crs\nst_crs(MC_2018) #27700\n#Extract all West Midlands County outline data from the large main dataframe\nWest_Midlands_County <- MC_2018[grepl('West Midlands', MC_2018$mcty18nm), ]\n\n```\n\nAll weapon possession crimes then need to then be filtered out to those which occur in West Midlands County.\n\n```{r}\n#Filter out weapon crimes for all of West Midlands County\nall_crime_weapon_possession <- all_crime_wm |>\n  filter(`Crime type` == \"Possession of weapons\" & !is.na(Longitude) & !is.na(Latitude)) |>\n  #Keep longitude/latitude columns\n  dplyr::select(Longitude, Latitude) |>\n  #Transform into point spatial dataframe\n  st_as_sf(coords = c(\"Longitude\", \"Latitude\"), crs = 4236) |>\n  #Transform CRS into 27700 for BNG\n  st_transform(27700)\n```\n\nThe hexagonal grid can be created around all of the weapon possession crimes next. 'c(500,500)' specifies the size of each polygon, and by specifying 'square = FALSE', the polygons in the grid will all be hexagon shaped.\n\n```{r}\n#Make hexagonal grid\narea_honeycomb_grid = st_make_grid(all_crime_weapon_possession, \n                                   c(500, 500), \n                                   what = \"polygons\", \n                                   square = FALSE)\n#Sf and add grid ID\nhoneycomb_grid_sf = st_sf(area_honeycomb_grid) %>%\n  mutate(grid_id = 1:length(lengths(area_honeycomb_grid)))\n```\n\nThe number of weapon crimes in each hexagon can be counted, and these hexagons can be clipped to the West Midlands County boundary created 3 chunks above.\n\n```{r}\n#Count number of weapon crimes in each grid\nhoneycomb_grid_sf$weapon_possession = lengths(st_intersects(honeycomb_grid_sf, all_crime_weapon_possession))\n#Clip to West Midlands Boundary\nhoneycomb_grid_wm <- honeycomb_grid_sf |>\n  st_intersection(West_Midlands_County)\n\n```\n\n## Applying raster population data to hexagon grid map\n\nInstead of using NOMIS 2021 population census data to create the weapon possession rate per 1000 people, raster population data needs to be used. This data covers the entire United Kingdom at 1 kilometre resolution, showing population estimates for each kilometre squared grid. This data can be merged to fit into the hexagons, and then the rate can be calculated via the steps below.\n\nFirstly, the raster population data needs to be loaded into R.\n\n```{r, fig.align='center'}\n#Load raster population data for 2020 UK\npop2020 <- rast(\"gbr_ppp_2020_1km_Aggregated.tif\")\n#Transform projection to EPSG:27700\npop2020 <- pop2020 |> project(\"epsg:27700\")\n#Check how this is plotted\nplot(pop2020)\n```\n\nThis is useful, but this data needs to be cropped to fit the specific region in this study.\n\n```{r, fig.align='center'}\n#Crop and mask raster data to fit into the honeycomb area\npop2020_wm <- crop(pop2020, honeycomb_grid_wm)\npop2020_wm <- mask(pop2020_wm, honeycomb_grid_wm)\n#Check how this is plotted\nplot(pop2020_wm)\n```\n\nThis now shows population estimates in 1km grids across West Midlands County, but this still needs to be merged to the hexagon map spatial file.\n\nTo do this, the raster data needs to be aggregated and then added to the hexagon spatial dataframe. The function to aggregate the data 'fun' is set to the mean.\n\n```{r}\n#Aggregate\nwm_hex_pop <- extract(pop2020_wm, honeycomb_grid_wm, fun = mean)\n#Add to spatial dataframe\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  st_as_sf() |>\n  mutate(population2020 = wm_hex_pop$gbr_ppp_2020_1km_Aggregated)\n\n```\n\nThe results of this can be plotted in a map to check if the tasks have been conducted correctly.\n\n```{r, warning=FALSE, fig.align='center'}\n#Plot map of population in each 500m hexagon in West Midlands County\ntm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2,\n             col = 'black',\n             alpha = 1) +\n  tm_shape(honeycomb_grid_wm) +\n  tm_fill(col = \"population2020\",\n          palette = 'YlGnBu',\n          style = \"quantile\",\n          n=5,\n          title = \"Population Count\",\n          id = \"grid_id\",\n          showNA = FALSE,\n          alpha = 0.6,\n          popup.vars = c(\"Population Count: \" = \"population2020\"),\n          popup.format = list(population2020 = list(format = \"f\", digits = 0))) +\n  tm_borders(col = \"grey40\", \n             lwd = 0.7) +\n  tm_layout(main.title = \"Population Count in 500 metre hexagons in West Midlands County - 2020\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0,5,10,15,20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits(\"Data Source: ONS, WorldPop\",\n             position = c('right', 'bottom'),\n             fontface = 'italic', \n             size = 0.5)\n```\n\nThis map provides a view into how the population is distributed in the county. Birmingham and Coventry have the highest number of residents, and Solihull has the lowest, with most residents concentrated in the north. This map will be useful to refer to throughout the study to understand how population density is inherently linked with the occurrence of weapon possession crimes.\n\nNow that each hexagon contains data for the number of weapon crimes and population, these two variable can be manipulated to create a weapon possession rate per 1000 people variable to be used throughout the study.\n\n```{r}\n#Calculate weapon crime rate per 1000 people variable using the newly created population variable\nhoneycomb_grid_wm$weaponcrime_rate <- (honeycomb_grid_wm$weapon_possession/honeycomb_grid_wm$population2020)*1000\n\n```\n\n## Map of Weapon Possession Crime Rates in West Midlands County\n\nUsing the variable created in the previous step, and the presentation standards outlined in the first maps created, a final map of weapon possession crime rates in the study area can be produced and analysed. The palette has now been selected using a colour choice of my design, where areas with a crime rate of 0 are indicted in green, and areas with increasing crime rates transition from yellow to red.\n\n```{r, warning=FALSE, fig.align='center'}\n#Create hex weapon crime rate per 1000 map\ntm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2,\n             col = 'black',\n             alpha = 1) +\n  tm_shape(honeycomb_grid_wm) +\n  tm_fill(col = \"weaponcrime_rate\",\n          palette = c(\"#009900\", \"#ffff00\", \"#ffcc00\", \"#ffa600\", \"#ff7300\", \"#ff4d00\", \"#ff2600\", \"#ff0000\"),\n          style = \"fixed\",\n          n=8,\n          breaks = c(0,0.1,0.5,0.9,1.5,4.0,10,36,631),\n          title = \"Weapon Possession Crime Rate per 1000 people\",\n          id = \"grid_id\",\n          showNA = FALSE,\n          alpha = 0.6,\n          popup.vars = c(\"Weapon Possession Crime Rate per 1000 people: \" = \"weaponcrime_rate\"),\n          popup.format = list(weaponcrime_rate = list(format = \"f\", digits = 0))) +\n  tm_borders(col = \"grey40\", \n             lwd = 0.7) +\n  tm_layout(main.title = \"Weapon Possession Crime Rate in West Midlands County - 2023\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0,5,10,15,20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits(\"Data Source: ONS, West Midlands Police, WorldPop\",\n             position = c('right', 'bottom'),\n             fontface = 'italic', \n             size = 0.5)\n\n```\n\nAll 7 local authorities’ city centres have the highest weapon crime rates, but there are substantial variations in the rates occurring across the county.\n\nThe authority of Solihull has very rates of weapon crimes, except the city centre which has many hexagons coloured in amber, and some other hexagons located just south in the deep red colour. Birmingham has the greatest number hexagons with weapon crimes occurring, with over half of its area having a minimum of 0.1 weapon crimes occurring per 1000 people. These higher crime rates are mostly concentrated around Birmingham city centre. This pattern is similar for the other authorities, most evident in Coventry and Wolverhampton.\n\n## Spatial Autocorrelation\n\nWhile the hexagon map produced above is useful for identifying weapon possession crime trends, further geospatial queries and techniques can be conducted on the dataset. One useful technique is spatial autocorrelation, which measures the degree to which similar values (of crime) occur near eachother in a study region, in a positive or negative manner. This concept links to Tobler's Fist Law of Geography which is \"Everything is related to everything else, but near things are more related than distant things\", a foundational concept in GIS.\n\nIn order to conduct spatial autocorrelation, the neighbour radius of each hexagon needs to be defined, to conduct a spatial weights matrix, which helps to quantify the influence of a particular hexagon on surrounding hexagons. This is used to calculate Global and Local measures of Spatial Autocorrelation.\n\nIn this particular study, a fixed distance neighbour definition is used, which defines a hexagon's neighbours as spatial units which lie within a fixed distance (in this case 1500 metre radius) of the particular hexagon.\n\n```{r}\n#Calculate fixed distance neighbours\nhex_neighbours_fd <- dnearneigh(st_geometry(st_centroid(honeycomb_grid_wm)),\n                                 0, 1500)\n\n#Calculate centroids of all hex grids in West Midlands county\nhex_centroid <- honeycomb_grid_wm |>\n  st_centroid()\n\n#Plot fixed distance neighbours\nplot(hex_neighbours_fd, st_geometry(hex_centroid), col = \"blue\", pch = 20, cex = 0.5)\n\n#Create neighbours list\nhex_spatial_weights_fd <- hex_neighbours_fd |>\n  nb2listw(style = \"W\")\n```\n\nCentroids of each hexagon are used in the neighbour determination, as this provides a uniform method of defining where the 1500 metre radius should be drawn from each hexagon.\n\nGlobal spatial autocorrelation measures identify the degree of clustering or dispersion of the data in the entire study area. The most commonly used global method is Moran's I, which quantifies the degree of autocorrelation, providing correlation coefficients between an area and its neighbours. A score is provided between 1 and -1, with 1 indicating perfect clustering, and -1 indicating perfect dispersion across the region.\n\n```{r}\n#Create a Moran's plot\nmoran.plot(honeycomb_grid_wm$weaponcrime_rate, listw = hex_spatial_weights_fd)\n\n#Conduct Moran's I\nmoran_fd <- honeycomb_grid_wm |>\n  pull(weaponcrime_rate) |>\n  as.vector() |>\n  moran.test(hex_spatial_weights_fd)\n\n#Inspect result\nmoran_fd\n#=3.944465e-02\n```\n\nThe overall value of Moran's I is 3.944465e-02, indicating there is little to no spatial autocorrelation among weapon possession crime rates in the study area. This indicates that areas with neither high crime rates or low crime rates are clustered among similar areas.\n\nLocal spatial autocorrelation measures can also be conducted across the study area, which provide a Moran's I value for each individual hexagon, and can be useful to identify local clusters and outliers.\n\n```{r}\n#Conduct Local Moran's I\nlocal_moran_fd <- honeycomb_grid_wm |>\n  pull(weaponcrime_rate) |>\n  as.vector() |>\n  localmoran(hex_spatial_weights_fd)\n\n#Inspect result\nhead(local_moran_fd)\n\n```\n\nThe variable names can be renamed for clarity and these values can be binded to the hexagon grid data frame.\n\n```{r}\n#Update heading names\nlocal_moran_fd <- as.data.frame(local_moran_fd)\nnames(local_moran_fd) <- c(\"LMI_Ii\", \"LMI_eIi\", \"LMI_varIi\", \"LMI_zIi\", \"LMI_sigP\")\n\n#Join the data frames together\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(local_moran_fd)\n```\n\nThe local values can now be mapped across the study area as shown below.\n\n```{r, warning=FALSE, fig.align='center'}\n#Map Local Moran's I\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"LMI_Ii\",\n              style = \"pretty\",\n              midpoint = 0,\n              title = \"Local Moran's I statistic\") +\n  tm_layout(main.title = \"Local Moran's I statistic\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"bottom\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\"))\n```\n\nThis is not a very presentable nor easy to interpret map, so it can be refined. Significance breaks can be set to identify which areas have the most significant Moran's I values. Additionally, a colour palette can be set to identify these significant hexagons on the map as shown below.\n\n```{r, warning=FALSE, fig.align='center'}\n#Set significance breaks\nbreaks <- c(0, 0.05, 0.1, 1)\n\n#Set colour palette\ncolours <- c(\"#ffffff\", \"#ff9480\", \"#ff2800\")\n\n#Map Local Moran's I with the significant points coloured\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"LMI_sigP\",\n              style = \"fixed\",\n              breaks = breaks,\n              palette = rev(colours),\n              title = \"p-value of Local Moran's I statistic\") +\n  tm_layout(main.title = \"Local Moran's I Significant clusters\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"bottom\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\"))\n```\n\nThis map confirms the result from the Global test, where there does not appear to be much spatial autocorrelation in the data, but this map identifies that Central Birmingham and North Solihull have significant clusters of crime data. This map can be further refined as outlined below.\n\nUsing both Moran's I values and statistical significance for each hexagon, a Local Indicators of Spatial Autocorrelation (LISA) map can be created, as outlined by Anselin (1995) here <https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1538-4632.1995.tb00338.x>. The map creates 4 quadrants, which identify different types of spatial autocorrelation. Low-low identifies areas with low values surrounded by low values of crime and high-high identifies areas with high values surrounded by high values of crime. High-low identifies areas with a high value surrounded by areas with low values, and Low-high identifies areas with a low value surrounded by areas with high values, essentially identifying hexagons which are outliers.\n\nTo create this map, significance breaks and a significance level need to be set. In this study, the significance level is set to 0.1.\n\n```{r}\n#Set Significance breaks\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(obs_diff = (weaponcrime_rate - mean(honeycomb_grid_wm$weaponcrime_rate)))\n\n#Compare local Local Moran's I value with mean value\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(LMI_diff = (honeycomb_grid_wm$LMI_Ii - mean(honeycomb_grid_wm$LMI_Ii)))\n\n#Set significance threshold\nsignif <- 0.1\n```\n\nThe four different types of clusters can then be identified, and colour palette can be selected for the map which will be produced.\n\n```{r}\n#Set the four types of clusters that can be present\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(cluster_type = case_when(\n    obs_diff > 0 & LMI_diff > 0 & LMI_sigP < signif ~ \"High-High\",\n    obs_diff < 0 & LMI_diff < 0 & LMI_sigP < signif ~ \"Low-Low\",\n    obs_diff < 0 & LMI_diff > 0 & LMI_sigP < signif ~ \"Low-High\",\n    obs_diff > 0 & LMI_diff < 0 & LMI_sigP < signif ~ \"High-Low\",\n    LMI_sigP > signif ~ \"No Significance\"))\n\n#Count cluster types\ncount(honeycomb_grid_wm, cluster_type)\n\n#Create colour palette\npal <- c(\"#ff2800\", \"#ff9480\", \"#133a7c\", \"#ffffff\")\n```\n\nThe LISA map can now be produced, as shown in this code chunk.\n\n```{r, warning=FALSE, fig.align='center'}\n#Plot the different clusters as a LISA map\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"cluster_type\",\n              palette = pal,\n              title = \"Cluster Type\") +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"LISA map of weapon crime rate in West Midlands County\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, WorldPop',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThis map shows that there is a high-high cluster of weapon crime rates in Central Birmingham, with some high-low clusters towards the edge of the centre. Additionally, North Solihull is mostly a low-low cluster of weapon crime rates, but there are particular hexagons in the area which identify high weapon crime rates.\n\nA different measure of spatial autocorrelation can also be conducted. The Getis Ord Gi\\* statistic can be calculated for each hexagon and a hot/cold spot map can be produced across the study area. This method was proposed by Getis and Ord (1992) here <https://onlinelibrary.wiley.com/doi/10.1111/j.1538-4632.1992.tb00261.x>. The method compares local values to the global sum, considering spatial relationships between neighbours; and the method incorporates the spatial weights matrix and computes z-scores to determine significance. Using z-scores, adjusting for significance, hotspots and cold spots can be determined where higher z-scores indicate hotspots and lower z-scores indicate cold spots.\n\nUsing the defined fixed distance neighbours, the Gi\\* test can be conducted, and this data can be joined to the hexagon data frame.\n\n```{r}\n#Gi* test\ngi_fd <- honeycomb_grid_wm |>\n  pull(weaponcrime_rate) |>\n  as.vector() |>\n  localG(hex_spatial_weights_fd)\n\n#Join data together\nhoneycomb_grid_wm <- honeycomb_grid_wm |>\n  mutate(weaponcrime_gi = as.numeric(gi_fd))\n\n#Inspect dataset\nhoneycomb_grid_wm\n```\n\nUsing the data above, and selecting an appropriate colour palette, the hot/cold spot map can be created as shown below.\n\n```{r, warning=FALSE, fig.align='center'}\n#Set colour palette\npal2 <- c(\"#81c4ff\", \"#ff9480\", \"#ff3e1a\", \"#ff2800\", \"#b31c00\")\n\n#Plot the different clusters\ntm_shape(honeycomb_grid_wm) +\n  tm_polygons(col = \"weaponcrime_gi\",\n              style = \"pretty\",\n              midpoint = 0,\n              title = \"Local Gi* statistic\",\n              palette = pal2) +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"Hot/Coldspot map of weapon crime rates in West Midlands County\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, WorldPop',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThis map suggests that the highest weapon crime rates are found in North Solihull, and to a lesser degree in the central areas of all other local authorities. Most areas outside the city centres have dispersed weapon crime rates.\n\n## Geographically Weighted Regression\n\nTo test the relationship between weapon crime rates and another variable of interest, a geographically weighted regression (GWR) can be performed. This is better than a linear regression model, as GWR accounts for spatial weights within each spatial unit. The comparison variable of interest for this study is the Index of Multiple Deprivation (IMD), as this consists of many variables in its creation, including income and health statistics, and there could potentially be a link between high levels of deprivation and high crime rates.\n\n```{r, warning=FALSE, fig.align='center'}\n#Create detailed map to show IMD in the West Midlands\ntm_shape(WestMidlands_WeaponPossession) +\n  tm_fill(col = \"SOA_decile\",\n          style = \"fixed\",\n          palette = \"RdYlBu\",\n          n = 10,\n          #Breaks are chosen fixed with these intervals as IMD goes in this scale\n          breaks = c(0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10), \n          title = \"IMD Decile Scores\",\n          labels = c('Worst Performing', '9th', '8th', '7th', '6th', '5th', '4th', '3rd', '2nd', 'Best Performing')) +\n  tm_borders(lwd=0.1, \n             col = 'Lightgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"IMD decile scores for West Midlands County - 2019\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: ONS, CRDC',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThe map shows that the centres of Birmingham, Sandwell and Coventry have high deprivation scores, and most of Solihull and the edges of most authorities have low deprivation scores.\n\nA MAJOR NOTE FOR GWR: Since the IMD is calculated by LSOA, this cannot be aggregated to the hexagons formed in previous maps. Fortunately at the start of this report, weapon crime rates per 1000 people were calculated by LSOA, using 2021 population data from the census, so this will be used for this section.\n\nBefore conducting the GWR, a standard regression model is created to see what the inital correlation between weapon possession crime rates and the IMD.\n\n```{r}\nlinearmodel <- lm(WestMidlands_WeaponPossession$weapon_rate ~ WestMidlands_WeaponPossession$SOA_pct)\nsummary(linearmodel)\n#Multiple R-squared = 0.07289\n```\n\nWhile p-values are significant for this model, the relatively low multiple R-squared value of 0.07289 indicates that 7.29% of variance is explained by model. This model can be much improved through GWR.\n\nTo work with the 'spgwr' package, the spatial object needs to be reformatted.\n\n```{r}\n#The WestMidlands_WeaponPossession object reformatted to a different type of spatial object\nWestMidlands_WeaponPossession.SP<- as(WestMidlands_WeaponPossession, \"Spatial\")\n```\n\nThe GWR calculates local coefficients for each LSOA, using adaptive kernel bandwidths to provide stronger results by accounting for the varying data density in each LSOA.\n\n```{r}\n#Calculate kernel bandwidth, adaptive\nGWRbandwidth <- gwr.sel(WestMidlands_WeaponPossession.SP$weapon_rate ~ \n                          WestMidlands_WeaponPossession.SP$SOA_pct, \n                        data=WestMidlands_WeaponPossession.SP,\n                        adapt=T)\n```\n\nAfter performing this, the GWR model can be created and the results can be viewed.\n\n```{r}\n#Run GWR model and view the results after\ngwr.model = gwr(WestMidlands_WeaponPossession.SP$weapon_rate ~ \n                  WestMidlands_WeaponPossession.SP$SOA_pct, \n                data = WestMidlands_WeaponPossession.SP, \n                adapt=GWRbandwidth, \n                hatmatrix=TRUE, \n                se.fit=TRUE) \ngwr.model\n#Quasi-global R-squared = 0.364\n```\n\nWe can see here that the model performs much better than the linear model as the Quasi-global R2 is 0.3642764, much higher than the linear regression model's score of 0.07289. This indicates that 36.43% of variance is explained by model, which is still not high, but still shows that the GWR is an appropriate method.\n\nIn order to map these results, local coefficients and local R2 values need to be linked to the spatial data frame as shown below.\n\n```{r}\n#Use local R2 values from this model now and local coefficients\nresults <-as.data.frame(gwr.model$SDF)\nnames(results)\ngwr.map <- WestMidlands_WeaponPossession\ngwr.map <- cbind(WestMidlands_WeaponPossession, as.matrix(results))\n```\n\nThe local coefficients for the model can be mapped across West Midlands County, with an appropriate colour palette, and map elements as shown below. Initally a quick qtm map was made for this to see how the breaks are distributed. With this in mind I have selected appropriate class breaks as specified in breaksgwr. The variable \"WestMidlands_WeaponPossession.SP.SOA_pct\" represents the local GWR coefficients for each LSOA\n\n```{r, warning=FALSE, message=FALSE, fig.align='center'}\n#Create GWR coefficient map for IMD Rank\n#Set palette first\npal3 <- c('#ff8000', '#ff9d3b', '#ffce9d', '#7cffc1' ,'#31a354', '#006837')\nbreaksgwr <- c(-3.779, -1.000, -0.500, 0, 0.5000, 1.000, 5.311)\n\ntm_shape(gwr.map) + \n  tm_fill(\"WestMidlands_WeaponPossession.SP.SOA_pct\", \n          n = 6, \n          breaks = breaksgwr, \n          title = \"IMD Rank Coefficient\",\n          palette = pal3) + \n  tm_borders(lwd=0.2, \n             col = 'darkgrey', \n             alpha = 0.1) +\n  tm_shape(LA_WestMidlands) +\n  tm_borders(lwd=2, \n             col = 'Black', \n             alpha = 1) +\n  tm_layout(main.title = \"GWR Analysis: IMD vs Weapon Crime Rate in West Midlands County\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 5, 10, 15, 20),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits('Data source: West Midlands Police, ONS, Nomis, CRDC',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThe map displays the local coefficients for each LSOA. Orange coloured areas, such as most of Wolverhampton, central Coventry and Walsall have a negative correlation between the IMD and the weapon crime rate. Areas in the green colour, such as central Birmingham and north and south Solihull show a positive correlation between weapon crime rate and IMD scores. This result was expected as other studies have found a link between deprivation and knife crime.\n\n## Focus on Birmingham\n\nDue to the GWR results suggesting that there is a positive correlation between deprivation and the weapon possession rate, and that Birmingham is the largest city/local authority in the county, the area has been selected for further analysis of weapon crimes.\n\nAnother factor as suggested by academics which links to crime is unemployment, so the first part of the Birmingham analysis will may unemployment across each Ward in the authority, and provide locations of where weapon possession crimes took place.\n\nIt is important in this report to know the names of the wards being discussed across Birmingham as shown in this map. (Source: <https://www.birmingham.gov.uk/wards>).\n\n```{r, echo=FALSE}\nknitr::include_graphics('wards in birmingham.jpg')\n```\n\nMore data preparation steps are required to conduct this as the scale of the maps is changing from the entirety of West Midlands County by LSOA to Birmingham by Ward. Additionally, unemployment and other associated variables need to be loaded into R.\n\nFirstly all the crimes in West Midlands County need to be filtered by weapon possession and transformed to the correct CRS, similar to the first set of data preparation in this report.\n\n```{r}\n#Filter all crimes by Possession of Weapons\ncrime_weapon_possession <- all_crime_wm |>\n  filter(`Crime type` == \"Possession of weapons\" & !is.na(Longitude) & !is.na(Latitude)) |>\n  #Keep longitude/latitude columns\n  dplyr::select(Longitude, Latitude) |>\n  #Transform into point spatial dataframe, set CRS to 4236\n  st_as_sf(coords = c(\"Longitude\", \"Latitude\"), crs = 4236) |>\n  #Transform CRS into 27700 for BNG\n  st_transform(27700)\n```\n\nThis set of spatial data points needs to be saved as a geopackage and loaded back into R.\n\n```{r}\n#Save the crime_weapon_possession spatial frame from the chunk above using st_write as \"WestMidlands_Weapons_2023.gpkg\"\n\n#Load weapon data geopackage in\nweapons_wm_2023 <- st_read(\"WestMidlands_Weapons_2023.gpkg\")\n\n```\n\nThis map is just a test to see whether all the crime points have been created correctly. It should look like this.\n\n```{r, fig.align='center'}\n#Test to see if all data has loaded correctly\n#Plot West Midlands LSOAs and Possession of Weapons points\ntm_shape(LSOA_WestMidlands) +\n  tm_fill() +\n  tm_shape(weapons_wm_2023) +\n  tm_dots(col = \"blue\")\n\n```\n\nSince this section of the report only focuses on Birmingham, the spatial data frames need to be filtered to just include information on Birmingham as shown below.\n\n```{r}\n#Extract out the Birmingham Local Authority\nLA_Birmingham <- LA_eng_2023[grepl('Birmingham', LA_eng_2023$LAD23NM), ]\n\n#Extract out the Birmingham LSOAs\nLSOA_Birmingham <- LSOA_eng_2021[grepl('Birmingham', LSOA_eng_2021$LSOA21NM), ]\n\n#Extract all Birmingham data from the large main dataframe\nBirmingham_WeaponPossession <- WestMidlands_WeaponPossession[grepl('Birmingham', WestMidlands_WeaponPossession$LSOA21NM), ]\n\n```\n\nNext the ward spatial data for Birmingham needs to be loaded into R. After inspecting the dataset, it appears that rows 2752 to 2820 contain all the wards in Birmingham, so these are extracted and the shape is checked to see if there are any errors.\n\n```{r, fig.align='center'}\n#Load in Ward gpkg data\nWards_2023 <- st_read(\"Wards_2023.gpkg\")\n#Check crs\nst_crs(Wards_2023) #27700\n\n#Extract out all wards in Birmingham\nrows_to_extract <- 2752:2820\nWards_Birmingham <- Wards_2023[rows_to_extract, ]\n\n#Check the wards shape is correct\ntm_shape(Wards_Birmingham)+\n  tm_fill() +\n  tm_borders()\n```\n\nIf the map produced looks like the one above, the data preparation steps have been conducted correctly.\n\nAll weapon crimes now need to be filtered to include those which took place in Birmingham. Previous steps which were conducted need to be taken place to sort the newly created all_crime_birmingham into a set of points which only contains data on weapon possession crimes.\n\n```{r}\n#Extract all crimes committed in Birmingham\nall_crime_birmingham <- all_crime_wm[grepl('Birmingham', all_crime_wm$`LSOA name`), ]\n\n#Repeat lines to filter out weapon crimes\nbirmingham_crime_weapon_possession <- all_crime_birmingham |>\n  filter(`Crime type` == \"Possession of weapons\" & !is.na(Longitude) & !is.na(Latitude)) |>\n  #Keep longitude/latitude columns\n  dplyr::select(Longitude, Latitude) |>\n  #Transform into point spatial dataframe, set CRS to 4236\n  st_as_sf(coords = c(\"Longitude\", \"Latitude\"), crs = 4236) |>\n  #Transform CRS into 27700 for BNG\n  st_transform(27700)\n\n#Save the birmingham_crime_weapon_possession spatial frame using st_write as \"Birmingham_Weapons_2023.gpkg\"\n\n#Load weapon data geopackage in\nweapons_birmingham_2023 <- st_read(\"Birmingham_Weapons_2023.gpkg\")\n\n```\n\nAgain, it is useful to check if these tasks have been performed correctly by producing a simple map as shown below.\n\n```{r, fig.align='center'}\n#Check the data works in a map\ntm_shape(LSOA_Birmingham) +\n  tm_fill() +\n  tm_shape(weapons_birmingham_2023) +\n  tm_dots(col = \"blue\")\n```\n\nThis is a correct map which shows all the weapon possession crimes across Birmingham.\n\nThe hexagon map that was previously created for the entirety of West Midlands County can be reproduced for Birmingham. The entire spatial query can be re conducted, with a different hexagon size, but as this is just a demonstration of how what the map would look like, it is kept at the same hexagon size of 500 metres. The only adjustment made in the map design is the breaks have been changed to fit the crime rates for Birmingham, where values range from 0 to 28 instead of 0 to 631.\n\n```{r, warning=FALSE, fig.align='center'}\n#Clip data to fit Birmingham\nhoneycomb_grid_birmingham <- honeycomb_grid_wm |>\n  st_intersection(LA_Birmingham)\n#Create detailed map to show the number of weapons crimes in Birmingham\ntm_shape(LA_Birmingham) +\n  tm_borders(lwd=2,\n             col = 'black',\n             alpha = 1) +\n  tm_shape(honeycomb_grid_birmingham) +\n  tm_fill(col = \"weaponcrime_rate\",\n          palette = c(\"#009900\", \"#ffff00\", \"#ffcc00\", \"#ffa600\", \"#ff7300\", \"#ff4d00\", \"#ff2600\", \"#ff0000\"),\n          style = \"fixed\",\n          n=8,\n          breaks = c(0,0.1,0.5,1,1.5,2,5,10,28),\n          title = \"Weapon Possession Crime Rate per 1000 people\",\n          id = \"grid_id\",\n          showNA = FALSE,\n          alpha = 0.6,\n          popup.vars = c(\"Weapon Possession Crime Rate per 1000 people: \" = \"weaponcrime_rate\"),\n          popup.format = list(weaponcrime_rate = list(format = \"f\", digits = 0))) +\n  tm_borders(col = \"grey40\", \n             lwd = 0.7) +\n  tm_layout(main.title = \"Weapon Possession Crime Rate in Birmingham - 2023\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0,2.5,5,7.5,10),\n               position = c(\"left\", \"top\")) +\n  tm_credits(\"Data Source: ONS, West Midlands Police, WorldPop\",\n             position = c('right', 'bottom'),\n             fontface = 'italic', \n             size = 0.5)\n```\n\nThis is effectively a zoomed in version of the original hexagon map, clearly showing that central Birmingham and west Birmingham seem to have the highest crime rates, with north Birmingham seeing a small number of weapon crimes occurring, indicated by the large number of green hexagons.\n\n## Unemployment and Weapon Crime in Birmingham\n\nAs stated at the start of the previous section, unemployment in Birmingham will be studied alongside weapon possession.\n\nIn order to conduct this, the unemployment data by ward from the 2021 census (downloaded from NOMIS) needs to be loaded and configured in R. The dataset needs to be re coded to create a variable showing the percentage of people who have never worked in each ward. This could be combined with those who said they had not worked in the last 12 months, HOWEVER the 2021 census took place just after the 2020 COVID-19 lockdown, where many people were out of work in that period, so just using 'unemployment: never worked' will be the most reliable data. Additionally, these people are most likely to have stayed unemployed instead of starting work like the 12 month category.\n\n```{r}\n#Load dataset which contains unemployment data \nunemployment_input <- read.csv(\"ts065/census2021-ts065-ward.csv\")\n#Recode dataset to create a variable showing % of people who have never worked in each ward\nunemployment <- data.frame(ward_code=unemployment_input$geography.code,\n                           Unemployment_perc=(unemployment_input$Employment.history..Not.in.employment..Never.worked/unemployment_input$Employment.history..Total..All.usual.residents.aged.16.years.and.over.not.in.employment.the.week.before.the.census)*100)\n#Save dataset to workspace\nwrite.csv(unemployment, \"unemployment_data_ward.csv\", row.names=F)\n```\n\nThe .csv file created with unemployment percentage of each ward needs to be merged to the large spatial data frame which contains the shapes of all of the wards in Birmingham.\n\n```{r}\n#Merge unemployment data to the main spatial file\nWard_Birmingham_Census<- merge(Wards_Birmingham, unemployment, by.x=\"WD23CD\", by.y=\"ward_code\", all.x=T)\n#Replace all NAs with 0\nWard_Birmingham_Census[is.na(Ward_Birmingham_Census)] = 0\nView(Ward_Birmingham_Census)\n#All has merged correctly\n```\n\nBy viewing the dataset, it is easy to determine whether the columns have merged correctly. In each dataset there is a column for the ward code identifier, so it is specified in R that these two columns are the merging point of the two datasets.\n\nWith these preparation tasks being completed, a map can be produced to show unemployment percentages across Birmingham, with a layer of dots on the map to indicate where weapon possession crimes took place in 2023, as shown below. Breaks have been appropriately set by viewing the distribution of unemployment data\n\n```{r, warning=FALSE, fig.align='center'}\n#Choropleth map of weapon crime dots and unemployment percentage across wards\ntm_shape(Ward_Birmingham_Census) +\n  tm_fill(col = \"Unemployment_perc\",\n          style = \"fixed\",\n          palette = c(\"#dadaeb\", \"#bcbddc\", \"#9e9ac8\", \"#807dba\", \"#6a51a3\", \"#4a1486\"),\n          n = 6,\n          breaks = c(17, 29, 33, 36, 43, 54, 67),\n          title = \"% of Unemployed residents in Ward\") +\n  tm_borders(lwd=0.4, \n             col = 'black', \n             alpha = 0.8) +\n  tm_shape(LA_Birmingham) +\n  tm_borders(lwd=2, \n             col = 'black', \n             alpha = 1) +\n  tm_shape(weapons_birmingham_2023)+\n  tm_dots(col = 'red',\n          size = 0.05) +\n  tm_layout(main.title = \"% of Unemployed Residents and Weapon Crimes in Birmingham\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE, \n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 2.5, 5, 7.5, 10),\n               position = c(\"left\", \"top\")) +\n  tm_credits('Data source: West Midlands Police, ONS, Nomis',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nRed dots indicate each weapon possession crime which took place in 2023. The map clearly shows that the areas with low unemployment rates have a low number of weapon crimes, including all the wards in Sutton Coldfield, and the ward of Bourneville & Cotteridge. There are many areas with high unemployment and a high number of crimes closer to the city centre, including the wards of Handsworth and Small Heath.\n\n## Point Pattern Analysis\n\nPoint Pattern Analysis techniques, such as Kernel Density Estimation (KDE) can help to view whether weapon crimes are concentrated in certain areas of Birmingham statistically. KDE presents a heat map displaying the distribution between central areas (kernels) and their neighbouring regions. This is a useful technique to understand the clustering and concentration of weapon crimes using point data not aggregated to spatial units.\n\nThe spatial data needs to be converted to a ppp format from a sf (simple features) format, using the 'spatstat' package to conduct the KDE.\n\n```{r}\n#Sf to ppp\nwindow = as.owin(LA_Birmingham)\nbirmingham_weapon_crime_ppp <- ppp(st_coordinates(weapons_birmingham_2023)[, 1], \n                      st_coordinates(weapons_birmingham_2023)[,2], \n                      window = window)\n```\n\nIt is a good idea to inspect this ppp dataset.\n\n```{r}\n#Inspect\nplot(birmingham_weapon_crime_ppp)\n\n```\n\nThe warning suggests that there are duplicated points in the data, where weapon possession crimes have occurred in the same place. To fix this, an offset can be added to the points to remove any duplication issues.\n\n```{r}\n#Check for duplicates\nanyDuplicated(birmingham_weapon_crime_ppp)\n#Count number of duplicated points\nsum(multiplicity(birmingham_weapon_crime_ppp) > 1)\n\n#Add offset to points\nbirmingham_weapon_crime_ppp_jitter <- rjitter(birmingham_weapon_crime_ppp, \n                                 radius = 5, \n                                 retry = TRUE, \n                                 nsim = 1,\n                                 drop = TRUE)\n\n#Check for duplicates\nanyDuplicated(birmingham_weapon_crime_ppp_jitter)\n```\n\nBy doing this all duplication warnings have been resolved.\n\nEach crime point needs to be fitted to a Gaussian kernel bandwidth. The Gaussian method is the most commonly used, but there are other types of bandwidths available. A sigma value needs to be determined for each crime point kernel to determine the radius of the bandwidth, helping to define which points can be placed in the clusters. The value chosen for this study is 800 metres. This value was selected to ensure a sufficiently smooth density distribution was created and that no key features in the data were distorted.\n\n```{r}\n#Clip by Birmingham outline to raster\n#800m sigma value\nkde_800g_raster <- density.ppp(birmingham_weapon_crime_ppp_jitter, sigma = 800) |>\n  rast()\n\n#Add CRS\ncrs(kde_800g_raster) <- \"epsg:27700\"\n\n#Check CRS\nst_crs(kde_800g_raster)\n```\n\nThe KDE raster layer for weapon possession crimes can now be mapped as shown below. The palette is chosen appropriately from the 'RColorBrewer' package, and the style is chosen as 'cont' as this provides the most aesthetically pleasing map where the colour gradient changes smoother than a standard method.\n\n```{r, warning=FALSE, fig.align='center'}\n#Map kde raster\ntm_shape(kde_800g_raster) +\n  tm_raster(col = \"lyr.1\",\n    palette = 'YlOrRd', \n    style = 'cont',\n    title = \"KDE Layer\") +\n  tm_shape(Wards_Birmingham) +\n  tm_borders(lwd=0.5,\n             alpha=0.5,\n             col = 'black') +\n  tm_shape(LA_Birmingham) +\n  tm_borders(lwd=2,\n             alpha=1,\n             col = 'black') +\n  tm_layout(main.title = \"KDE Heatmap of weapon crimes in Birmingham\",\n            main.title.fontface = 2,\n            fontfamily = \"Mukta\",\n            legend.outside = TRUE,\n            frame = FALSE, \n            legend.outside.position = \"right\",\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 2.5, 5, 7.5, 10),\n               position = c(\"left\", \"top\")) +\n  tm_credits('Data source: West Midlands Police, ONS',\n             fontface = 'italic',\n             align = 'right',\n             size = 0.5)\n```\n\nThere is a clear high-density area in the city centre, with this area spreading out across most of the wards in Central Birmingham. In contrast Sutton Coldfield and wards in the south have low KDE values, indicating crimes are not clustered in these areas.\n\n## Link to train stations\n\nAs train stations are entry nodes for people unfamiliar to a city to enter, crime can concentrate in these locations, so crimes taking place within a certain proximity of train stations in Central Birmingham can be mapped.\n\nUsing the KDE analysis from the previous section, wards which lie in Central Birmingham have been selected for this map and its analysis, as most crimes tend to concentrate here.\n\nFirstly all wards in the central cluster area need to be extracted from the Ward_Birmingham_Census spatial data frame. By viewing this dataset, the names of the wards in the centre and what rows they are in the dataset can be selected for extraction.\n\n```{r}\n#Extract out wards in the central cluster area\nrows_to_extract_2 <- c(3,4,5,8,9,10,14,20,21,25,26,28,30,34,36,38,39,40,50,51,52,53,54,65,66,68,69)\nWard_Central_Birmingham_Census <- Ward_Birmingham_Census[rows_to_extract_2, ]\n```\n\nAgain, it is a good idea to check if this has been performed correctly.\n\n```{r, fig.align='center'}\n#Quick check of shape\ntm_shape(Ward_Central_Birmingham_Census)+\n  tm_fill() +\n  tm_borders()\n```\n\nIf the shape looks like this, the extraction has been performed correctly.\n\nThe outline of Central Birmingham needs to be specified for the Overpass API to extract train stations in the area from OpenStreetMap.\n\n```{r, fig.align='center'}\n#Union of data\ncentral_birmingham_outline <- Ward_Central_Birmingham_Census |>\n  st_union()\nplot(central_birmingham_outline)\n```\n\nIn order to extract the railway station points in this area, the latitude, longitude and bounding box of the outline need to be extracted for the Overpass API to extract the station data from OpenStreetMap.\n\n```{r}\n#Extract latitude, longitude bounding box from central Birmingham outline\np_bbox <- st_bbox(st_transform(central_birmingham_outline, 4326))\n```\n\nNext, a function in the Overpass API needs to be created which is able to extract stations from Open StreetMap in the defined area.\n\n```{r}\n#Call OverPassQuery function\nstations_central_birmingham_osm <- opq(bbox = p_bbox) |>\n  #Add key and values to sf\n  add_osm_feature(key = \"public_transport\", value = \"station\") |>\n  osmdata_sf()\n```\n\nNow the railway station points can be extracted. Steps such as clipping the data to the outline of central Birmingham, and selecting relevant attributes of each station, such as the name, needs to be conducted here aswell.\n\n```{r}\n#Extract only points\nstations_central_birmingham_osm <- stations_central_birmingham_osm$osm_points |>\n  #Add projection information\n  st_set_crs(4326) |>\n  #Reproject to BNG\n  st_transform(27700) |>\n  #Clip to central Birmingham outline\n  st_intersection(central_birmingham_outline) |>\n  #Select relevant attributes\n  dplyr::select(c(\"osm_id\", \"name\", \"network\", \"operator\", \"public_transport\", \"railway\"))\n```\n\nThese points can now be inspected to see which stations from OSM have been extracted, and if any modifications need to be made.\n\n```{r, fig.align='center'}\n#Inspect these points\nplot(stations_central_birmingham_osm)\n\n```\n\nThis study is only concerned with railways stations not all public transport nodes, so these are extracted from this data frame.\n\n```{r}\n#Extract train stations\nstations_central_birmingham_osm <- stations_central_birmingham_osm |>\n  filter(railway == \"station\")\n\n```\n\nNow these stations can be mapped across Central Birmingham to see if all steps have been conducted correctly, and to visualise the distribution of stations.\n\n```{r, fig.align='center'}\n#Add Central Birmingham outline\ntm_shape(Ward_Central_Birmingham_Census) +\n  tm_fill() +\n  tm_borders() +\n  #Add station data\n  tm_shape(stations_central_birmingham_osm) +\n  tm_dots(col = \"black\",\n          size = 0.1) +\n  #Add other map info\n  tm_compass(type = \"arrow\",\n    position = c(\"right\", \"top\")) +\n  tm_scale_bar(breaks = c(0, 1, 2, 3, 4, 5),\n    position = c(\"left\", \"bottom\")) +\n  tm_credits(\"© OpenStreetMap contributors, ONS\")\n```\n\nNow the proximity calculation of the number of weapon crimes occurring within a fixed distance of each station can be conducted. Firstly a single geometry needs to be created for the data.\n\n```{r}\n#Create a single geometry\nstations_central_birmingham_osm_compare <- stations_central_birmingham_osm |>\n  st_union()\n```\n\nFor this study, a 500 metre buffer will be created around each station to count the number of crimes occurring in this radius. 500 metres is chosen as this is a small enough zone around each station where people may immediately travel around upon entering Birmingham.\n\n```{r}\n#Generate a 500m buffer\nstation_500m_buffer <- stations_central_birmingham_osm |>\n  st_buffer(dist = 500)\n\n```\n\nThis buffer can now be used to count the number of weapon possession crime points which fall within the buffer region.\n\n```{r}\n#Intersect buffers with weapon possession crimes and work out number of crimes in each buffer\nstation_500m_buffer$`Total Count` <- lengths(st_intersects(station_500m_buffer, weapons_birmingham_2023))\n\n```\n\nNow a final map can be produced which shows the number of weapon crimes occurring within 500 metres of each railway station in Central Birmingham. This map uses proportionally sized dots using the 'tm_bubbles' function to indicate how many crimes occur around each station. Additionally, these dots are overlayed on a map of unemployment rates across Central Birmingham.\n\n```{r, warning=FALSE, fig.align='center'}\ntm_shape(Ward_Central_Birmingham_Census)+\n  tm_borders(lwd = 0.5,\n             col = 'black',\n             alpha = 1)+\n  tm_fill(col = \"Unemployment_perc\",\n          style = \"fixed\",\n          palette = c(\"#f4f9fd\", \"#9fccf0\", \"#5ba7e6\", \"#2182d2\", \"#16588e\", \"#0b2e4a\"),\n          n = 6,\n          breaks = c(0, 30, 34, 36, 43, 54, 67),\n          title = \"% of unemployed residents in Ward\") +\ntm_shape(station_500m_buffer) +\n  tm_bubbles(size = \"Total Count\", \n             col = \"red\", \n             n=8, \n             style = \"quantile\", \n             legend.size.show=TRUE, \n             title.col = \"Count\", \n             border.col = \"black\", \n             border.lwd = 0.1, \n             border.alpha = 0.1)+\n  tm_layout(main.title = \"Number of Weapon Crimes within 500 metres of a railway station\",\n            main.title.fontface = 2,\n            fontfamily = \"Helvetica\",\n            legend.outside = TRUE,\n            frame = FALSE,\n            legend.position = c(\"left\", \"top\"),\n            legend.title.size = 1,\n            legend.title.fontface = 2) +\n  tm_compass(type = \"arrow\",\n             position = c(\"right\", \"bottom\")) +\n  tm_scale_bar(breaks = c(0,1,2,3,4,5),\n               position = c(\"left\", \"bottom\")) +\n  tm_credits(\"© OpenStreetMap contributors, ONS, West Midlands Police\",\n             position = c('right', 'top'),\n             fontface = 'italic', \n             size = 0.5)\n```\n\nAlthough there is theoretical evidence to suggest crimes cluster around stations, this is not the case for 13/16 of the stations having low weapon crime counts. However, three stations: Birmingham New Street, Birmingham Snow Hill, and Birmingham Moor Street, in the city centre have a cluster of weapon crimes occurring within a 500m radius. This makes sense as these are the three stations which connect Birmingham to other major cities in the UK, such as Manchester and London, being a node for people unfamiliar to Birmingham to enter the city.\n\nA major caveat to this is that weapon possession crimes are statistically more likely to occur in a city centre where large groups of people form, and that the large number of crimes by the central stations is a product of this.\n\n## Conclusions and Final Remarks\n\nIn conclusion, this social atlas shows that weapon possession crimes are unevenly distributed in West Midlands County, with clear clusters being identified. The report showed that in certain areas, (Central Birmingham & Solihull) using GWR, there is a positive correlation between the IMD and weapon crime. Additionally, there appears to be a link between unemployment and weapon crime, but it is less clear whether weapon crimes cluster around railway stations. The findings illustrate that there are many factors that link to weapon possession crimes, and that local councils, especially those in Birmingham need to provide strategies to prevent crimes from rising even further.\n\nIt is very important to note that this is not a conclusive study of every single factor which is linked to weapon possession crimes across the region, as for example, population density and household income, among many other factors, need to be accounted for when producing a wider study of the issue. Some of these variables may help to explain some of the trends found in this report, such as why crimes are concentrated in city centres.\n\nOverall, I hope this report provides an overview of weapon crime issues in West Midlands County, and also an overview of different geospatial techniques that can be conducted in RStudio on geospatial data, and large data sets with geographic elements present.\n\n## References\n\nAllen, G., H. Carthew and Y. Zayed (2023) ‘Knife crime statistics England and Wales’, London: House of Commons, <https://commonslibrary.parliament.uk/research-briefings/sn04304/>.\n\nAnselin, L. (1995) ‘Local Indicators of Spatial Association—LISA’, Geographical Analysis, 27, 2, 93-115, <https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1538-4632.1995.tb00338.x>.\n\nBonnier, A., M. Finné and E. Weiberg (2019) ‘Examining land-use through GIS-Based kernel density estimation: a Re-Evaluation of legacy data from the berbati-limnes survey’, Journal of Field Archaeology, 44, 2, 70-83, <https://www.tandfonline.com/doi/full/10.1080/00934690.2019.1570481>.\n\nBrunsdon, C., A.S. Fotheringham and M.E. Charlton (1996) ‘Geographically Weighted Regression: A Method for Exploring Spatial Nonstationarity’, Geographical Analysis, 28, 4, 281-298, <https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1538-4632.1996.tb00936.x>.\n\nCarter, R.L. and K.Q. Hill (1976) ‘The Criminal’s Image of the City and Urban Crime Patterns’, Social Science Quarterly, 57, 3, 597-607, <https://www.sciencedirect.com/book/9780080246338/the-criminals-image-of-the-city>.\n\nCheshire, J.A. and P.A. Longley (2011) ‘Identifying spatial concentrations of surnames’, International Journal of Geographic Information Science, 26, 2, 309-325, <https://www.tandfonline.com/doi/full/10.1080/13658816.2011.591291>.\n\nChiu, S. (1991) ‘Bandwidth Selection for Kernel Density Estimation’, The Annals of Statistics, 19, 4, 1883-1905, <https://www.jstor.org/stable/2241909>.\n\nClement, M. (2010) ‘Teenagers under the knife: a decivilising process’, Journal of Youth Studies, 13, 4, 439-451, <https://www.tandfonline.com/doi/full/10.1080/13676261003802406>.\n\nGetis, A. and J.K. Ord (1992) ‘The Analysis of Spatial Association by Use of Distance Statistics’, Geographical Analysis, 24, 3, 189-206, <https://onlinelibrary.wiley.com/doi/10.1111/j.1538-4632.1992.tb00261.x>.\n\nGimond, M. (2023) Intro to GIS and spatial analysis, ‘Chapter 13: Spatial autocorrelation’, <https://mgimond.github.io/Spatial/spatial-autocorrelation.html>.\n\nHaylock, S., T. Boshari, E.C. Alexander, A. Kumar, L. Manikam and R. Pinder (2020) ‘Risk factors associated with knife-crime in United Kingdom among young people aged 10–24 years: a systematic review’, BMC Public Health, 20, 1451, 1-19, <https://bmcpublichealth.biomedcentral.com/counter/pdf/10.1186/s12889-020-09498-4.pdf>.\n\nIrvin-Erickson, Y. and N. La Vigne (2015) ‘A Spatio-temporal Analysis of Crime at Washington, DC Metro Rail: Stations’ Crime-generating and Crime-attracting Characteristics as Transportation Nodes and Places’, Crime Science, 4, 14, 1-13, <https://crimesciencejournal.biomedcentral.com/articles/10.1186/s40163-015-0026-5>.\n\nLee, S. (2019) ‘Uncertainty in the effects of the modifiable areal unit problem under different levels of spatial autocorrelation: a simulation study’, International Journal of Geographical Information Science, 33, 1, 1135-1154, <https://www.tandfonline.com/doi/full/10.1080/13658816.2018.1542699>.\n\nLivings, M. and A.M. Wu (2020) ‘Local Measures of Spatial Association’ The Geographic Information Science & Technology Body of Knowledge (3rd Quarter 2020 Edition), John P. Wilson (Ed.), <https://gistbok-topics.ucgis.org/AM-03-023>.\n\nLongley, P. et al. (2015) Geographic Information Science & Systems, ‘Chapter 4: Georeferencing’, pp. 77-98, <https://app.knovel.com/kn/resources/kpGISSE001/toc?kpromoter=marc>.\n\nLongley, P.A., J. van Dijk and T. Lan (2021) ‘The geography of intergenerational social mobility in Britain’, Nature Communications, 12, 6050, 1-8, <https://www.nature.com/articles/s41467-021-26185-z>.\n\nRawlinson (2024) ‘Idris Elba calls for immediate ban on machetes and ‘zombie’ knives’, London: The Guardian, <https://www.theguardian.com/uk-news/2024/jan/08/idris-elba-calls-for-immediate-ban-on-machetes-and-zombie-knives?ref=upstract.com>.\n\nRengert, G.F. and B. Lockwood (2009) ‘Geographical Units of Analysis and the Analysis of Crime’, in D. Weisburd, W. Bernasco, and G.J. Bruinsma (eds) Putting Crime in its Place, New York: Springer, 109-122, <https://link.springer.com/chapter/10.1007/978-0-387-09688-9_5>.\n\nShi, X. (2010) ‘Selection of bandwidth type and adjustment side in kernel density estimation over inhomogeneous backgrounds’, International Journal of Geographic Information Science, 24, 5, 643-660, <https://www.tandfonline.com/doi/full/10.1080/13658810902950625>.\n\nThapa, R.B. and R.C. Estoque (2012) ‘Geographically Weighted Regression in Geospatial Analysis’, in Y. Murayama (ed.) Progress in Geospatial Analysis, Tokyo: Springer, 85-96, <https://link.springer.com/chapter/10.1007/978-4-431-54000-7_6>.\n\nWest Midlands Police (2024) ‘Compare your area’, London: Police.UK, <https://www.police.uk/pu/your-area/west-midlands-police/performance/compare-your-area/?tc=BW001>.\n\nWong, D. (2009) ‘Modifiable Areal Unit Problem’, International Encyclopedia of Human Geography, 169-174, <https://www.sciencedirect.com/science/article/abs/pii/B9780080449104004752>.\n\nWong, K. (2021) ‘Create spatial square/hexagon grids and count points inside in R with sf’, Hong Kong: Urban Data Palette, <https://urbandatapalette.com/post/2021-08-tessellation-sf/>.\n\nZhang, H., R. Zahnow, Y. Liu and J. Corcoran (2022) ‘Crime at train stations: The role of passenger presence’, Applied Geography, 140, <https://www.sciencedirect.com/science/article/abs/pii/S0143622822000376>.\n\nZhao, J., H. Zhang and J.A. Zhang (2020) ‘Gaussian kernel adaptive filters with adaptive kernel bandwidth’, Signal Processing, 166, 107270, <https://www.sciencedirect.com/science/article/abs/pii/S016516841930324X>.\n"},"formats":{"html":{"identifier":{"display-name":"HTML","target-format":"html","base-format":"html"},"execute":{"fig-width":7,"fig-height":5,"fig-format":"retina","fig-dpi":96,"df-print":"default","error":false,"eval":true,"cache":null,"freeze":false,"echo":true,"output":true,"warning":true,"include":true,"keep-md":false,"keep-ipynb":false,"ipynb":null,"enabled":null,"daemon":null,"daemon-restart":false,"debug":false,"ipynb-filters":[],"ipynb-shell-interactivity":null,"plotly-connected":true,"engine":"knitr"},"render":{"keep-tex":false,"keep-typ":false,"keep-source":false,"keep-hidden":false,"prefer-html":false,"output-divs":true,"output-ext":"html","fig-align":"default","fig-pos":null,"fig-env":null,"code-fold":"none","code-overflow":"scroll","code-link":false,"code-line-numbers":false,"code-tools":false,"tbl-colwidths":"auto","merge-includes":true,"inline-includes":false,"preserve-yaml":false,"latex-auto-mk":true,"latex-auto-install":true,"latex-clean":true,"latex-min-runs":1,"latex-max-runs":10,"latex-makeindex":"makeindex","latex-makeindex-opts":[],"latex-tlmgr-opts":[],"latex-input-paths":[],"latex-output-dir":null,"link-external-icon":false,"link-external-newwindow":false,"self-contained-math":false,"format-resources":[],"notebook-links":true},"pandoc":{"standalone":true,"wrap":"none","default-image-extension":"png","to":"html","css":["styles.css"],"toc":true,"output-file":"weapon_crime_social_atlas.html"},"language":{"toc-title-document":"Table of contents","toc-title-website":"On this page","related-formats-title":"Other Formats","related-notebooks-title":"Notebooks","source-notebooks-prefix":"Source","other-links-title":"Other Links","code-links-title":"Code Links","launch-dev-container-title":"Launch Dev Container","launch-binder-title":"Launch Binder","article-notebook-label":"Article Notebook","notebook-preview-download":"Download Notebook","notebook-preview-download-src":"Download Source","notebook-preview-back":"Back to Article","manuscript-meca-bundle":"MECA Bundle","section-title-abstract":"Abstract","section-title-appendices":"Appendices","section-title-footnotes":"Footnotes","section-title-references":"References","section-title-reuse":"Reuse","section-title-copyright":"Copyright","section-title-citation":"Citation","appendix-attribution-cite-as":"For attribution, please cite this work as:","appendix-attribution-bibtex":"BibTeX citation:","title-block-author-single":"Author","title-block-author-plural":"Authors","title-block-affiliation-single":"Affiliation","title-block-affiliation-plural":"Affiliations","title-block-published":"Published","title-block-modified":"Modified","title-block-keywords":"Keywords","callout-tip-title":"Tip","callout-note-title":"Note","callout-warning-title":"Warning","callout-important-title":"Important","callout-caution-title":"Caution","code-summary":"Code","code-tools-menu-caption":"Code","code-tools-show-all-code":"Show All Code","code-tools-hide-all-code":"Hide All Code","code-tools-view-source":"View Source","code-tools-source-code":"Source Code","tools-share":"Share","tools-download":"Download","code-line":"Line","code-lines":"Lines","copy-button-tooltip":"Copy to Clipboard","copy-button-tooltip-success":"Copied!","repo-action-links-edit":"Edit this page","repo-action-links-source":"View source","repo-action-links-issue":"Report an issue","back-to-top":"Back to top","search-no-results-text":"No results","search-matching-documents-text":"matching documents","search-copy-link-title":"Copy link to search","search-hide-matches-text":"Hide additional matches","search-more-match-text":"more match in this document","search-more-matches-text":"more matches in this document","search-clear-button-title":"Clear","search-text-placeholder":"","search-detached-cancel-button-title":"Cancel","search-submit-button-title":"Submit","search-label":"Search","toggle-section":"Toggle section","toggle-sidebar":"Toggle sidebar navigation","toggle-dark-mode":"Toggle dark mode","toggle-reader-mode":"Toggle reader mode","toggle-navigation":"Toggle navigation","crossref-fig-title":"Figure","crossref-tbl-title":"Table","crossref-lst-title":"Listing","crossref-thm-title":"Theorem","crossref-lem-title":"Lemma","crossref-cor-title":"Corollary","crossref-prp-title":"Proposition","crossref-cnj-title":"Conjecture","crossref-def-title":"Definition","crossref-exm-title":"Example","crossref-exr-title":"Exercise","crossref-ch-prefix":"Chapter","crossref-apx-prefix":"Appendix","crossref-sec-prefix":"Section","crossref-eq-prefix":"Equation","crossref-lof-title":"List of Figures","crossref-lot-title":"List of Tables","crossref-lol-title":"List of Listings","environment-proof-title":"Proof","environment-remark-title":"Remark","environment-solution-title":"Solution","listing-page-order-by":"Order By","listing-page-order-by-default":"Default","listing-page-order-by-date-asc":"Oldest","listing-page-order-by-date-desc":"Newest","listing-page-order-by-number-desc":"High to Low","listing-page-order-by-number-asc":"Low to High","listing-page-field-date":"Date","listing-page-field-title":"Title","listing-page-field-description":"Description","listing-page-field-author":"Author","listing-page-field-filename":"File Name","listing-page-field-filemodified":"Modified","listing-page-field-subtitle":"Subtitle","listing-page-field-readingtime":"Reading Time","listing-page-field-wordcount":"Word Count","listing-page-field-categories":"Categories","listing-page-minutes-compact":"{0} min","listing-page-category-all":"All","listing-page-no-matches":"No matching items","listing-page-words":"{0} words"},"metadata":{"lang":"en","fig-responsive":true,"quarto-version":"1.4.553","editor":"visual","theme":"cosmo","smooth-scroll":true,"title":"A GIS study of weapon possession crimes in West Midlands County (2023)"},"extensions":{"book":{"multiFile":true}}}},"projectFormats":["html"]}